grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
#pragma once 

/* --- PIOC: Parallel Input/Output Controller C --------------------- */

#define PIOC_PER			MMIO32(PIOC_BASE + 0x00)
#define PIOC_PDR			MMIO32(PIOC_BASE + 0x04)
#define PIOC_PSR			MMIO32(PIOC_BASE + 0x08)
#define PIOC_OER			MMIO32(PIOC_BASE + 0x10)
#define PIOC_ODR			MMIO32(PIOC_BASE + 0x14)
#define PIOC_OSR			MMIO32(PIOC_BASE + 0x18)
#define PIOC_IFER			MMIO32(PIOC_BASE + 0x20)
#define PIOC_IFDR			MMIO32(PIOC_BASE + 0x24)
#define PIOC_IFSR			MMIO32(PIOC_BASE + 0x28)
#define PIOC_SODR			MMIO32(PIOC_BASE + 0x30)
#define PIOC_CODR			MMIO32(PIOC_BASE + 0x34)
#define PIOC_ODSR			MMIO32(PIOC_BASE + 0x38)
#define PIOC_PDSR			MMIO32(PIOC_BASE + 0x3c)
#define PIOC_IER			MMIO32(PIOC_BASE + 0x40)
#define PIOC_IDR			MMIO32(PIOC_BASE + 0x44)
#define PIOC_IMR			MMIO32(PIOC_BASE + 0x48)
#define PIOC_ISR			MMIO32(PIOC_BASE + 0x4c)
#define PIOC_MDER			MMIO32(PIOC_BASE + 0x50)
#define PIOC_MDDR			MMIO32(PIOC_BASE + 0x54)
#define PIOC_MDSR			MMIO32(PIOC_BASE + 0x58)
#define PIOC_PUDR			MMIO32(PIOC_BASE + 0x60)
#define PIOC_PUER			MMIO32(PIOC_BASE + 0x64)
#define PIOC_PUSR			MMIO32(PIOC_BASE + 0x68)
#define PIOC_ABCDSR[0]			MMIO32(PIOC_BASE + 0x70)
#define PIOC_ABCDSR[1]			MMIO32(PIOC_BASE + 0x74)
#define PIOC_IFSCDR			MMIO32(PIOC_BASE + 0x80)
#define PIOC_IFSCER			MMIO32(PIOC_BASE + 0x84)
#define PIOC_IFSCSR			MMIO32(PIOC_BASE + 0x88)
#define PIOC_SCDR			MMIO32(PIOC_BASE + 0x8c)
#define PIOC_PPDDR			MMIO32(PIOC_BASE + 0x90)
#define PIOC_PPDER			MMIO32(PIOC_BASE + 0x94)
#define PIOC_PPDSR			MMIO32(PIOC_BASE + 0x98)
#define PIOC_OWER			MMIO32(PIOC_BASE + 0xa0)
#define PIOC_OWDR			MMIO32(PIOC_BASE + 0xa4)
#define PIOC_OWSR			MMIO32(PIOC_BASE + 0xa8)
#define PIOC_AIMER			MMIO32(PIOC_BASE + 0xb0)
#define PIOC_AIMDR			MMIO32(PIOC_BASE + 0xb4)
#define PIOC_AIMMR			MMIO32(PIOC_BASE + 0xb8)
#define PIOC_ESR			MMIO32(PIOC_BASE + 0xc0)
#define PIOC_LSR			MMIO32(PIOC_BASE + 0xc4)
#define PIOC_ELSR			MMIO32(PIOC_BASE + 0xc8)
#define PIOC_FELLSR			MMIO32(PIOC_BASE + 0xd0)
#define PIOC_REHLSR			MMIO32(PIOC_BASE + 0xd4)
#define PIOC_FRLHSR			MMIO32(PIOC_BASE + 0xd8)
#define PIOC_LOCKSR			MMIO32(PIOC_BASE + 0xe0)
#define PIOC_WPMR			MMIO32(PIOC_BASE + 0xe4)
#define PIOC_WPSR			MMIO32(PIOC_BASE + 0xe8)
#define PIOC_SCHMITT			MMIO32(PIOC_BASE + 0x100)
#define PIOC_PCMR			MMIO32(PIOC_BASE + 0x150)
#define PIOC_PCIER			MMIO32(PIOC_BASE + 0x154)
#define PIOC_PCIDR			MMIO32(PIOC_BASE + 0x158)
#define PIOC_PCIMR			MMIO32(PIOC_BASE + 0x15c)
#define PIOC_PCISR			MMIO32(PIOC_BASE + 0x160)
#define PIOC_PCRHR			MMIO32(PIOC_BASE + 0x164)


/* --- PIOC_PER values ---------------------------------------------- */


/* @def PIOC_PER_P31
* @brief PIO Enable */
#define PIOC_PER_P31		(1 << 31)

/* @def PIOC_PER_P30
* @brief PIO Enable */
#define PIOC_PER_P30		(1 << 30)

/* @def PIOC_PER_P29
* @brief PIO Enable */
#define PIOC_PER_P29		(1 << 29)

/* @def PIOC_PER_P28
* @brief PIO Enable */
#define PIOC_PER_P28		(1 << 28)

/* @def PIOC_PER_P27
* @brief PIO Enable */
#define PIOC_PER_P27		(1 << 27)

/* @def PIOC_PER_P26
* @brief PIO Enable */
#define PIOC_PER_P26		(1 << 26)

/* @def PIOC_PER_P25
* @brief PIO Enable */
#define PIOC_PER_P25		(1 << 25)

/* @def PIOC_PER_P24
* @brief PIO Enable */
#define PIOC_PER_P24		(1 << 24)

/* @def PIOC_PER_P23
* @brief PIO Enable */
#define PIOC_PER_P23		(1 << 23)

/* @def PIOC_PER_P22
* @brief PIO Enable */
#define PIOC_PER_P22		(1 << 22)

/* @def PIOC_PER_P21
* @brief PIO Enable */
#define PIOC_PER_P21		(1 << 21)

/* @def PIOC_PER_P20
* @brief PIO Enable */
#define PIOC_PER_P20		(1 << 20)

/* @def PIOC_PER_P19
* @brief PIO Enable */
#define PIOC_PER_P19		(1 << 19)

/* @def PIOC_PER_P18
* @brief PIO Enable */
#define PIOC_PER_P18		(1 << 18)

/* @def PIOC_PER_P17
* @brief PIO Enable */
#define PIOC_PER_P17		(1 << 17)

/* @def PIOC_PER_P16
* @brief PIO Enable */
#define PIOC_PER_P16		(1 << 16)

/* @def PIOC_PER_P15
* @brief PIO Enable */
#define PIOC_PER_P15		(1 << 15)

/* @def PIOC_PER_P14
* @brief PIO Enable */
#define PIOC_PER_P14		(1 << 14)

/* @def PIOC_PER_P13
* @brief PIO Enable */
#define PIOC_PER_P13		(1 << 13)

/* @def PIOC_PER_P12
* @brief PIO Enable */
#define PIOC_PER_P12		(1 << 12)

/* @def PIOC_PER_P11
* @brief PIO Enable */
#define PIOC_PER_P11		(1 << 11)

/* @def PIOC_PER_P10
* @brief PIO Enable */
#define PIOC_PER_P10		(1 << 10)

/* @def PIOC_PER_P9
* @brief PIO Enable */
#define PIOC_PER_P9		(1 << 9)

/* @def PIOC_PER_P8
* @brief PIO Enable */
#define PIOC_PER_P8		(1 << 8)

/* @def PIOC_PER_P7
* @brief PIO Enable */
#define PIOC_PER_P7		(1 << 7)

/* @def PIOC_PER_P6
* @brief PIO Enable */
#define PIOC_PER_P6		(1 << 6)

/* @def PIOC_PER_P5
* @brief PIO Enable */
#define PIOC_PER_P5		(1 << 5)

/* @def PIOC_PER_P4
* @brief PIO Enable */
#define PIOC_PER_P4		(1 << 4)

/* @def PIOC_PER_P3
* @brief PIO Enable */
#define PIOC_PER_P3		(1 << 3)

/* @def PIOC_PER_P2
* @brief PIO Enable */
#define PIOC_PER_P2		(1 << 2)

/* @def PIOC_PER_P1
* @brief PIO Enable */
#define PIOC_PER_P1		(1 << 1)

/* @def PIOC_PER_P0
* @brief PIO Enable */
#define PIOC_PER_P0		(1 << 0)

/* --- PIOC_PDR values ---------------------------------------------- */


/* @def PIOC_PDR_P31
* @brief PIO Disable */
#define PIOC_PDR_P31		(1 << 31)

/* @def PIOC_PDR_P30
* @brief PIO Disable */
#define PIOC_PDR_P30		(1 << 30)

/* @def PIOC_PDR_P29
* @brief PIO Disable */
#define PIOC_PDR_P29		(1 << 29)

/* @def PIOC_PDR_P28
* @brief PIO Disable */
#define PIOC_PDR_P28		(1 << 28)

/* @def PIOC_PDR_P27
* @brief PIO Disable */
#define PIOC_PDR_P27		(1 << 27)

/* @def PIOC_PDR_P26
* @brief PIO Disable */
#define PIOC_PDR_P26		(1 << 26)

/* @def PIOC_PDR_P25
* @brief PIO Disable */
#define PIOC_PDR_P25		(1 << 25)

/* @def PIOC_PDR_P24
* @brief PIO Disable */
#define PIOC_PDR_P24		(1 << 24)

/* @def PIOC_PDR_P23
* @brief PIO Disable */
#define PIOC_PDR_P23		(1 << 23)

/* @def PIOC_PDR_P22
* @brief PIO Disable */
#define PIOC_PDR_P22		(1 << 22)

/* @def PIOC_PDR_P21
* @brief PIO Disable */
#define PIOC_PDR_P21		(1 << 21)

/* @def PIOC_PDR_P20
* @brief PIO Disable */
#define PIOC_PDR_P20		(1 << 20)

/* @def PIOC_PDR_P19
* @brief PIO Disable */
#define PIOC_PDR_P19		(1 << 19)

