grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_PDR_P18
* @brief PIO Disable */
#define PIOC_PDR_P18		(1 << 18)

/* @def PIOC_PDR_P17
* @brief PIO Disable */
#define PIOC_PDR_P17		(1 << 17)

/* @def PIOC_PDR_P16
* @brief PIO Disable */
#define PIOC_PDR_P16		(1 << 16)

/* @def PIOC_PDR_P15
* @brief PIO Disable */
#define PIOC_PDR_P15		(1 << 15)

/* @def PIOC_PDR_P14
* @brief PIO Disable */
#define PIOC_PDR_P14		(1 << 14)

/* @def PIOC_PDR_P13
* @brief PIO Disable */
#define PIOC_PDR_P13		(1 << 13)

/* @def PIOC_PDR_P12
* @brief PIO Disable */
#define PIOC_PDR_P12		(1 << 12)

/* @def PIOC_PDR_P11
* @brief PIO Disable */
#define PIOC_PDR_P11		(1 << 11)

/* @def PIOC_PDR_P10
* @brief PIO Disable */
#define PIOC_PDR_P10		(1 << 10)

/* @def PIOC_PDR_P9
* @brief PIO Disable */
#define PIOC_PDR_P9		(1 << 9)

/* @def PIOC_PDR_P8
* @brief PIO Disable */
#define PIOC_PDR_P8		(1 << 8)

/* @def PIOC_PDR_P7
* @brief PIO Disable */
#define PIOC_PDR_P7		(1 << 7)

/* @def PIOC_PDR_P6
* @brief PIO Disable */
#define PIOC_PDR_P6		(1 << 6)

/* @def PIOC_PDR_P5
* @brief PIO Disable */
#define PIOC_PDR_P5		(1 << 5)

/* @def PIOC_PDR_P4
* @brief PIO Disable */
#define PIOC_PDR_P4		(1 << 4)

/* @def PIOC_PDR_P3
* @brief PIO Disable */
#define PIOC_PDR_P3		(1 << 3)

/* @def PIOC_PDR_P2
* @brief PIO Disable */
#define PIOC_PDR_P2		(1 << 2)

/* @def PIOC_PDR_P1
* @brief PIO Disable */
#define PIOC_PDR_P1		(1 << 1)

/* @def PIOC_PDR_P0
* @brief PIO Disable */
#define PIOC_PDR_P0		(1 << 0)

/* --- PIOC_PSR values ---------------------------------------------- */


/* @def PIOC_PSR_P31
* @brief PIO Status */
#define PIOC_PSR_P31		(1 << 31)

/* @def PIOC_PSR_P30
* @brief PIO Status */
#define PIOC_PSR_P30		(1 << 30)

/* @def PIOC_PSR_P29
* @brief PIO Status */
#define PIOC_PSR_P29		(1 << 29)

/* @def PIOC_PSR_P28
* @brief PIO Status */
#define PIOC_PSR_P28		(1 << 28)

/* @def PIOC_PSR_P27
* @brief PIO Status */
#define PIOC_PSR_P27		(1 << 27)

/* @def PIOC_PSR_P26
* @brief PIO Status */
#define PIOC_PSR_P26		(1 << 26)

/* @def PIOC_PSR_P25
* @brief PIO Status */
#define PIOC_PSR_P25		(1 << 25)

/* @def PIOC_PSR_P24
* @brief PIO Status */
#define PIOC_PSR_P24		(1 << 24)

/* @def PIOC_PSR_P23
* @brief PIO Status */
#define PIOC_PSR_P23		(1 << 23)

/* @def PIOC_PSR_P22
* @brief PIO Status */
#define PIOC_PSR_P22		(1 << 22)

/* @def PIOC_PSR_P21
* @brief PIO Status */
#define PIOC_PSR_P21		(1 << 21)

/* @def PIOC_PSR_P20
* @brief PIO Status */
#define PIOC_PSR_P20		(1 << 20)

/* @def PIOC_PSR_P19
* @brief PIO Status */
#define PIOC_PSR_P19		(1 << 19)

/* @def PIOC_PSR_P18
* @brief PIO Status */
#define PIOC_PSR_P18		(1 << 18)

/* @def PIOC_PSR_P17
* @brief PIO Status */
#define PIOC_PSR_P17		(1 << 17)

/* @def PIOC_PSR_P16
* @brief PIO Status */
#define PIOC_PSR_P16		(1 << 16)

/* @def PIOC_PSR_P15
* @brief PIO Status */
#define PIOC_PSR_P15		(1 << 15)

/* @def PIOC_PSR_P14
* @brief PIO Status */
#define PIOC_PSR_P14		(1 << 14)

/* @def PIOC_PSR_P13
* @brief PIO Status */
#define PIOC_PSR_P13		(1 << 13)

/* @def PIOC_PSR_P12
* @brief PIO Status */
#define PIOC_PSR_P12		(1 << 12)

/* @def PIOC_PSR_P11
* @brief PIO Status */
#define PIOC_PSR_P11		(1 << 11)

/* @def PIOC_PSR_P10
* @brief PIO Status */
#define PIOC_PSR_P10		(1 << 10)

/* @def PIOC_PSR_P9
* @brief PIO Status */
#define PIOC_PSR_P9		(1 << 9)

/* @def PIOC_PSR_P8
* @brief PIO Status */
#define PIOC_PSR_P8		(1 << 8)

/* @def PIOC_PSR_P7
* @brief PIO Status */
#define PIOC_PSR_P7		(1 << 7)

/* @def PIOC_PSR_P6
* @brief PIO Status */
#define PIOC_PSR_P6		(1 << 6)

/* @def PIOC_PSR_P5
* @brief PIO Status */
#define PIOC_PSR_P5		(1 << 5)

/* @def PIOC_PSR_P4
* @brief PIO Status */
#define PIOC_PSR_P4		(1 << 4)

/* @def PIOC_PSR_P3
* @brief PIO Status */
#define PIOC_PSR_P3		(1 << 3)

/* @def PIOC_PSR_P2
* @brief PIO Status */
#define PIOC_PSR_P2		(1 << 2)

/* @def PIOC_PSR_P1
* @brief PIO Status */
#define PIOC_PSR_P1		(1 << 1)

/* @def PIOC_PSR_P0
* @brief PIO Status */
#define PIOC_PSR_P0		(1 << 0)

/* --- PIOC_OER values ---------------------------------------------- */


/* @def PIOC_OER_P31
* @brief Output Enable */
#define PIOC_OER_P31		(1 << 31)

/* @def PIOC_OER_P30
* @brief Output Enable */
#define PIOC_OER_P30		(1 << 30)

/* @def PIOC_OER_P29
* @brief Output Enable */
#define PIOC_OER_P29		(1 << 29)

/* @def PIOC_OER_P28
* @brief Output Enable */
#define PIOC_OER_P28		(1 << 28)

/* @def PIOC_OER_P27
* @brief Output Enable */
#define PIOC_OER_P27		(1 << 27)

/* @def PIOC_OER_P26
* @brief Output Enable */
#define PIOC_OER_P26		(1 << 26)

/* @def PIOC_OER_P25
* @brief Output Enable */
#define PIOC_OER_P25		(1 << 25)

/* @def PIOC_OER_P24
* @brief Output Enable */
#define PIOC_OER_P24		(1 << 24)

/* @def PIOC_OER_P23
* @brief Output Enable */
#define PIOC_OER_P23		(1 << 23)

/* @def PIOC_OER_P22
* @brief Output Enable */
#define PIOC_OER_P22		(1 << 22)

/* @def PIOC_OER_P21
* @brief Output Enable */
#define PIOC_OER_P21		(1 << 21)

/* @def PIOC_OER_P20
* @brief Output Enable */
#define PIOC_OER_P20		(1 << 20)

/* @def PIOC_OER_P19
* @brief Output Enable */
#define PIOC_OER_P19		(1 << 19)

/* @def PIOC_OER_P18
* @brief Output Enable */
#define PIOC_OER_P18		(1 << 18)

/* @def PIOC_OER_P17
* @brief Output Enable */
#define PIOC_OER_P17		(1 << 17)

/* @def PIOC_OER_P16
* @brief Output Enable */
#define PIOC_OER_P16		(1 << 16)

/* @def PIOC_OER_P15
* @brief Output Enable */
#define PIOC_OER_P15		(1 << 15)

/* @def PIOC_OER_P14
* @brief Output Enable */
#define PIOC_OER_P14		(1 << 14)

/* @def PIOC_OER_P13
* @brief Output Enable */
#define PIOC_OER_P13		(1 << 13)

/* @def PIOC_OER_P12
* @brief Output Enable */
#define PIOC_OER_P12		(1 << 12)

/* @def PIOC_OER_P11
* @brief Output Enable */
#define PIOC_OER_P11		(1 << 11)

/* @def PIOC_OER_P10
* @brief Output Enable */
#define PIOC_OER_P10		(1 << 10)

/* @def PIOC_OER_P9
* @brief Output Enable */
#define PIOC_OER_P9		(1 << 9)

/* @def PIOC_OER_P8
* @brief Output Enable */
#define PIOC_OER_P8		(1 << 8)

/* @def PIOC_OER_P7
* @brief Output Enable */
#define PIOC_OER_P7		(1 << 7)

