grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_OER_P6
* @brief Output Enable */
#define PIOC_OER_P6		(1 << 6)

/* @def PIOC_OER_P5
* @brief Output Enable */
#define PIOC_OER_P5		(1 << 5)

/* @def PIOC_OER_P4
* @brief Output Enable */
#define PIOC_OER_P4		(1 << 4)

/* @def PIOC_OER_P3
* @brief Output Enable */
#define PIOC_OER_P3		(1 << 3)

/* @def PIOC_OER_P2
* @brief Output Enable */
#define PIOC_OER_P2		(1 << 2)

/* @def PIOC_OER_P1
* @brief Output Enable */
#define PIOC_OER_P1		(1 << 1)

/* @def PIOC_OER_P0
* @brief Output Enable */
#define PIOC_OER_P0		(1 << 0)

/* --- PIOC_ODR values ---------------------------------------------- */


/* @def PIOC_ODR_P31
* @brief Output Disable */
#define PIOC_ODR_P31		(1 << 31)

/* @def PIOC_ODR_P30
* @brief Output Disable */
#define PIOC_ODR_P30		(1 << 30)

/* @def PIOC_ODR_P29
* @brief Output Disable */
#define PIOC_ODR_P29		(1 << 29)

/* @def PIOC_ODR_P28
* @brief Output Disable */
#define PIOC_ODR_P28		(1 << 28)

/* @def PIOC_ODR_P27
* @brief Output Disable */
#define PIOC_ODR_P27		(1 << 27)

/* @def PIOC_ODR_P26
* @brief Output Disable */
#define PIOC_ODR_P26		(1 << 26)

/* @def PIOC_ODR_P25
* @brief Output Disable */
#define PIOC_ODR_P25		(1 << 25)

/* @def PIOC_ODR_P24
* @brief Output Disable */
#define PIOC_ODR_P24		(1 << 24)

/* @def PIOC_ODR_P23
* @brief Output Disable */
#define PIOC_ODR_P23		(1 << 23)

/* @def PIOC_ODR_P22
* @brief Output Disable */
#define PIOC_ODR_P22		(1 << 22)

/* @def PIOC_ODR_P21
* @brief Output Disable */
#define PIOC_ODR_P21		(1 << 21)

/* @def PIOC_ODR_P20
* @brief Output Disable */
#define PIOC_ODR_P20		(1 << 20)

/* @def PIOC_ODR_P19
* @brief Output Disable */
#define PIOC_ODR_P19		(1 << 19)

/* @def PIOC_ODR_P18
* @brief Output Disable */
#define PIOC_ODR_P18		(1 << 18)

/* @def PIOC_ODR_P17
* @brief Output Disable */
#define PIOC_ODR_P17		(1 << 17)

/* @def PIOC_ODR_P16
* @brief Output Disable */
#define PIOC_ODR_P16		(1 << 16)

/* @def PIOC_ODR_P15
* @brief Output Disable */
#define PIOC_ODR_P15		(1 << 15)

/* @def PIOC_ODR_P14
* @brief Output Disable */
#define PIOC_ODR_P14		(1 << 14)

/* @def PIOC_ODR_P13
* @brief Output Disable */
#define PIOC_ODR_P13		(1 << 13)

/* @def PIOC_ODR_P12
* @brief Output Disable */
#define PIOC_ODR_P12		(1 << 12)

/* @def PIOC_ODR_P11
* @brief Output Disable */
#define PIOC_ODR_P11		(1 << 11)

/* @def PIOC_ODR_P10
* @brief Output Disable */
#define PIOC_ODR_P10		(1 << 10)

/* @def PIOC_ODR_P9
* @brief Output Disable */
#define PIOC_ODR_P9		(1 << 9)

/* @def PIOC_ODR_P8
* @brief Output Disable */
#define PIOC_ODR_P8		(1 << 8)

/* @def PIOC_ODR_P7
* @brief Output Disable */
#define PIOC_ODR_P7		(1 << 7)

/* @def PIOC_ODR_P6
* @brief Output Disable */
#define PIOC_ODR_P6		(1 << 6)

/* @def PIOC_ODR_P5
* @brief Output Disable */
#define PIOC_ODR_P5		(1 << 5)

/* @def PIOC_ODR_P4
* @brief Output Disable */
#define PIOC_ODR_P4		(1 << 4)

/* @def PIOC_ODR_P3
* @brief Output Disable */
#define PIOC_ODR_P3		(1 << 3)

/* @def PIOC_ODR_P2
* @brief Output Disable */
#define PIOC_ODR_P2		(1 << 2)

/* @def PIOC_ODR_P1
* @brief Output Disable */
#define PIOC_ODR_P1		(1 << 1)

/* @def PIOC_ODR_P0
* @brief Output Disable */
#define PIOC_ODR_P0		(1 << 0)

/* --- PIOC_OSR values ---------------------------------------------- */


/* @def PIOC_OSR_P31
* @brief Output Status */
#define PIOC_OSR_P31		(1 << 31)

/* @def PIOC_OSR_P30
* @brief Output Status */
#define PIOC_OSR_P30		(1 << 30)

/* @def PIOC_OSR_P29
* @brief Output Status */
#define PIOC_OSR_P29		(1 << 29)

/* @def PIOC_OSR_P28
* @brief Output Status */
#define PIOC_OSR_P28		(1 << 28)

/* @def PIOC_OSR_P27
* @brief Output Status */
#define PIOC_OSR_P27		(1 << 27)

/* @def PIOC_OSR_P26
* @brief Output Status */
#define PIOC_OSR_P26		(1 << 26)

/* @def PIOC_OSR_P25
* @brief Output Status */
#define PIOC_OSR_P25		(1 << 25)

/* @def PIOC_OSR_P24
* @brief Output Status */
#define PIOC_OSR_P24		(1 << 24)

/* @def PIOC_OSR_P23
* @brief Output Status */
#define PIOC_OSR_P23		(1 << 23)

/* @def PIOC_OSR_P22
* @brief Output Status */
#define PIOC_OSR_P22		(1 << 22)

/* @def PIOC_OSR_P21
* @brief Output Status */
#define PIOC_OSR_P21		(1 << 21)

/* @def PIOC_OSR_P20
* @brief Output Status */
#define PIOC_OSR_P20		(1 << 20)

/* @def PIOC_OSR_P19
* @brief Output Status */
#define PIOC_OSR_P19		(1 << 19)

/* @def PIOC_OSR_P18
* @brief Output Status */
#define PIOC_OSR_P18		(1 << 18)

/* @def PIOC_OSR_P17
* @brief Output Status */
#define PIOC_OSR_P17		(1 << 17)

/* @def PIOC_OSR_P16
* @brief Output Status */
#define PIOC_OSR_P16		(1 << 16)

/* @def PIOC_OSR_P15
* @brief Output Status */
#define PIOC_OSR_P15		(1 << 15)

/* @def PIOC_OSR_P14
* @brief Output Status */
#define PIOC_OSR_P14		(1 << 14)

/* @def PIOC_OSR_P13
* @brief Output Status */
#define PIOC_OSR_P13		(1 << 13)

/* @def PIOC_OSR_P12
* @brief Output Status */
#define PIOC_OSR_P12		(1 << 12)

/* @def PIOC_OSR_P11
* @brief Output Status */
#define PIOC_OSR_P11		(1 << 11)

/* @def PIOC_OSR_P10
* @brief Output Status */
#define PIOC_OSR_P10		(1 << 10)

/* @def PIOC_OSR_P9
* @brief Output Status */
#define PIOC_OSR_P9		(1 << 9)

/* @def PIOC_OSR_P8
* @brief Output Status */
#define PIOC_OSR_P8		(1 << 8)

/* @def PIOC_OSR_P7
* @brief Output Status */
#define PIOC_OSR_P7		(1 << 7)

/* @def PIOC_OSR_P6
* @brief Output Status */
#define PIOC_OSR_P6		(1 << 6)

/* @def PIOC_OSR_P5
* @brief Output Status */
#define PIOC_OSR_P5		(1 << 5)

/* @def PIOC_OSR_P4
* @brief Output Status */
#define PIOC_OSR_P4		(1 << 4)

/* @def PIOC_OSR_P3
* @brief Output Status */
#define PIOC_OSR_P3		(1 << 3)

/* @def PIOC_OSR_P2
* @brief Output Status */
#define PIOC_OSR_P2		(1 << 2)

/* @def PIOC_OSR_P1
* @brief Output Status */
#define PIOC_OSR_P1		(1 << 1)

/* @def PIOC_OSR_P0
* @brief Output Status */
#define PIOC_OSR_P0		(1 << 0)

/* --- PIOC_IFER values --------------------------------------------- */


/* @def PIOC_IFER_P31
* @brief Input Filter Enable */
#define PIOC_IFER_P31		(1 << 31)

/* @def PIOC_IFER_P30
* @brief Input Filter Enable */
#define PIOC_IFER_P30		(1 << 30)

