grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_IFER_P29
* @brief Input Filter Enable */
#define PIOC_IFER_P29		(1 << 29)

/* @def PIOC_IFER_P28
* @brief Input Filter Enable */
#define PIOC_IFER_P28		(1 << 28)

/* @def PIOC_IFER_P27
* @brief Input Filter Enable */
#define PIOC_IFER_P27		(1 << 27)

/* @def PIOC_IFER_P26
* @brief Input Filter Enable */
#define PIOC_IFER_P26		(1 << 26)

/* @def PIOC_IFER_P25
* @brief Input Filter Enable */
#define PIOC_IFER_P25		(1 << 25)

/* @def PIOC_IFER_P24
* @brief Input Filter Enable */
#define PIOC_IFER_P24		(1 << 24)

/* @def PIOC_IFER_P23
* @brief Input Filter Enable */
#define PIOC_IFER_P23		(1 << 23)

/* @def PIOC_IFER_P22
* @brief Input Filter Enable */
#define PIOC_IFER_P22		(1 << 22)

/* @def PIOC_IFER_P21
* @brief Input Filter Enable */
#define PIOC_IFER_P21		(1 << 21)

/* @def PIOC_IFER_P20
* @brief Input Filter Enable */
#define PIOC_IFER_P20		(1 << 20)

/* @def PIOC_IFER_P19
* @brief Input Filter Enable */
#define PIOC_IFER_P19		(1 << 19)

/* @def PIOC_IFER_P18
* @brief Input Filter Enable */
#define PIOC_IFER_P18		(1 << 18)

/* @def PIOC_IFER_P17
* @brief Input Filter Enable */
#define PIOC_IFER_P17		(1 << 17)

/* @def PIOC_IFER_P16
* @brief Input Filter Enable */
#define PIOC_IFER_P16		(1 << 16)

/* @def PIOC_IFER_P15
* @brief Input Filter Enable */
#define PIOC_IFER_P15		(1 << 15)

/* @def PIOC_IFER_P14
* @brief Input Filter Enable */
#define PIOC_IFER_P14		(1 << 14)

/* @def PIOC_IFER_P13
* @brief Input Filter Enable */
#define PIOC_IFER_P13		(1 << 13)

/* @def PIOC_IFER_P12
* @brief Input Filter Enable */
#define PIOC_IFER_P12		(1 << 12)

/* @def PIOC_IFER_P11
* @brief Input Filter Enable */
#define PIOC_IFER_P11		(1 << 11)

/* @def PIOC_IFER_P10
* @brief Input Filter Enable */
#define PIOC_IFER_P10		(1 << 10)

/* @def PIOC_IFER_P9
* @brief Input Filter Enable */
#define PIOC_IFER_P9		(1 << 9)

/* @def PIOC_IFER_P8
* @brief Input Filter Enable */
#define PIOC_IFER_P8		(1 << 8)

/* @def PIOC_IFER_P7
* @brief Input Filter Enable */
#define PIOC_IFER_P7		(1 << 7)

/* @def PIOC_IFER_P6
* @brief Input Filter Enable */
#define PIOC_IFER_P6		(1 << 6)

/* @def PIOC_IFER_P5
* @brief Input Filter Enable */
#define PIOC_IFER_P5		(1 << 5)

/* @def PIOC_IFER_P4
* @brief Input Filter Enable */
#define PIOC_IFER_P4		(1 << 4)

/* @def PIOC_IFER_P3
* @brief Input Filter Enable */
#define PIOC_IFER_P3		(1 << 3)

/* @def PIOC_IFER_P2
* @brief Input Filter Enable */
#define PIOC_IFER_P2		(1 << 2)

/* @def PIOC_IFER_P1
* @brief Input Filter Enable */
#define PIOC_IFER_P1		(1 << 1)

/* @def PIOC_IFER_P0
* @brief Input Filter Enable */
#define PIOC_IFER_P0		(1 << 0)

/* --- PIOC_IFDR values --------------------------------------------- */


/* @def PIOC_IFDR_P31
* @brief Input Filter Disable */
#define PIOC_IFDR_P31		(1 << 31)

/* @def PIOC_IFDR_P30
* @brief Input Filter Disable */
#define PIOC_IFDR_P30		(1 << 30)

/* @def PIOC_IFDR_P29
* @brief Input Filter Disable */
#define PIOC_IFDR_P29		(1 << 29)

/* @def PIOC_IFDR_P28
* @brief Input Filter Disable */
#define PIOC_IFDR_P28		(1 << 28)

/* @def PIOC_IFDR_P27
* @brief Input Filter Disable */
#define PIOC_IFDR_P27		(1 << 27)

/* @def PIOC_IFDR_P26
* @brief Input Filter Disable */
#define PIOC_IFDR_P26		(1 << 26)

/* @def PIOC_IFDR_P25
* @brief Input Filter Disable */
#define PIOC_IFDR_P25		(1 << 25)

/* @def PIOC_IFDR_P24
* @brief Input Filter Disable */
#define PIOC_IFDR_P24		(1 << 24)

/* @def PIOC_IFDR_P23
* @brief Input Filter Disable */
#define PIOC_IFDR_P23		(1 << 23)

/* @def PIOC_IFDR_P22
* @brief Input Filter Disable */
#define PIOC_IFDR_P22		(1 << 22)

/* @def PIOC_IFDR_P21
* @brief Input Filter Disable */
#define PIOC_IFDR_P21		(1 << 21)

/* @def PIOC_IFDR_P20
* @brief Input Filter Disable */
#define PIOC_IFDR_P20		(1 << 20)

/* @def PIOC_IFDR_P19
* @brief Input Filter Disable */
#define PIOC_IFDR_P19		(1 << 19)

/* @def PIOC_IFDR_P18
* @brief Input Filter Disable */
#define PIOC_IFDR_P18		(1 << 18)

/* @def PIOC_IFDR_P17
* @brief Input Filter Disable */
#define PIOC_IFDR_P17		(1 << 17)

/* @def PIOC_IFDR_P16
* @brief Input Filter Disable */
#define PIOC_IFDR_P16		(1 << 16)

/* @def PIOC_IFDR_P15
* @brief Input Filter Disable */
#define PIOC_IFDR_P15		(1 << 15)

/* @def PIOC_IFDR_P14
* @brief Input Filter Disable */
#define PIOC_IFDR_P14		(1 << 14)

/* @def PIOC_IFDR_P13
* @brief Input Filter Disable */
#define PIOC_IFDR_P13		(1 << 13)

/* @def PIOC_IFDR_P12
* @brief Input Filter Disable */
#define PIOC_IFDR_P12		(1 << 12)

/* @def PIOC_IFDR_P11
* @brief Input Filter Disable */
#define PIOC_IFDR_P11		(1 << 11)

/* @def PIOC_IFDR_P10
* @brief Input Filter Disable */
#define PIOC_IFDR_P10		(1 << 10)

/* @def PIOC_IFDR_P9
* @brief Input Filter Disable */
#define PIOC_IFDR_P9		(1 << 9)

/* @def PIOC_IFDR_P8
* @brief Input Filter Disable */
#define PIOC_IFDR_P8		(1 << 8)

/* @def PIOC_IFDR_P7
* @brief Input Filter Disable */
#define PIOC_IFDR_P7		(1 << 7)

/* @def PIOC_IFDR_P6
* @brief Input Filter Disable */
#define PIOC_IFDR_P6		(1 << 6)

/* @def PIOC_IFDR_P5
* @brief Input Filter Disable */
#define PIOC_IFDR_P5		(1 << 5)

/* @def PIOC_IFDR_P4
* @brief Input Filter Disable */
#define PIOC_IFDR_P4		(1 << 4)

/* @def PIOC_IFDR_P3
* @brief Input Filter Disable */
#define PIOC_IFDR_P3		(1 << 3)

/* @def PIOC_IFDR_P2
* @brief Input Filter Disable */
#define PIOC_IFDR_P2		(1 << 2)

/* @def PIOC_IFDR_P1
* @brief Input Filter Disable */
#define PIOC_IFDR_P1		(1 << 1)

/* @def PIOC_IFDR_P0
* @brief Input Filter Disable */
#define PIOC_IFDR_P0		(1 << 0)

/* --- PIOC_IFSR values --------------------------------------------- */


/* @def PIOC_IFSR_P31
* @brief Input Filer Status */
#define PIOC_IFSR_P31		(1 << 31)

/* @def PIOC_IFSR_P30
* @brief Input Filer Status */
#define PIOC_IFSR_P30		(1 << 30)

/* @def PIOC_IFSR_P29
* @brief Input Filer Status */
#define PIOC_IFSR_P29		(1 << 29)

/* @def PIOC_IFSR_P28
* @brief Input Filer Status */
#define PIOC_IFSR_P28		(1 << 28)

/* @def PIOC_IFSR_P27
* @brief Input Filer Status */
#define PIOC_IFSR_P27		(1 << 27)

/* @def PIOC_IFSR_P26
* @brief Input Filer Status */
#define PIOC_IFSR_P26		(1 << 26)

/* @def PIOC_IFSR_P25
* @brief Input Filer Status */
#define PIOC_IFSR_P25		(1 << 25)

/* @def PIOC_IFSR_P24
* @brief Input Filer Status */
#define PIOC_IFSR_P24		(1 << 24)

