grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_IFSR_P23
* @brief Input Filer Status */
#define PIOC_IFSR_P23		(1 << 23)

/* @def PIOC_IFSR_P22
* @brief Input Filer Status */
#define PIOC_IFSR_P22		(1 << 22)

/* @def PIOC_IFSR_P21
* @brief Input Filer Status */
#define PIOC_IFSR_P21		(1 << 21)

/* @def PIOC_IFSR_P20
* @brief Input Filer Status */
#define PIOC_IFSR_P20		(1 << 20)

/* @def PIOC_IFSR_P19
* @brief Input Filer Status */
#define PIOC_IFSR_P19		(1 << 19)

/* @def PIOC_IFSR_P18
* @brief Input Filer Status */
#define PIOC_IFSR_P18		(1 << 18)

/* @def PIOC_IFSR_P17
* @brief Input Filer Status */
#define PIOC_IFSR_P17		(1 << 17)

/* @def PIOC_IFSR_P16
* @brief Input Filer Status */
#define PIOC_IFSR_P16		(1 << 16)

/* @def PIOC_IFSR_P15
* @brief Input Filer Status */
#define PIOC_IFSR_P15		(1 << 15)

/* @def PIOC_IFSR_P14
* @brief Input Filer Status */
#define PIOC_IFSR_P14		(1 << 14)

/* @def PIOC_IFSR_P13
* @brief Input Filer Status */
#define PIOC_IFSR_P13		(1 << 13)

/* @def PIOC_IFSR_P12
* @brief Input Filer Status */
#define PIOC_IFSR_P12		(1 << 12)

/* @def PIOC_IFSR_P11
* @brief Input Filer Status */
#define PIOC_IFSR_P11		(1 << 11)

/* @def PIOC_IFSR_P10
* @brief Input Filer Status */
#define PIOC_IFSR_P10		(1 << 10)

/* @def PIOC_IFSR_P9
* @brief Input Filer Status */
#define PIOC_IFSR_P9		(1 << 9)

/* @def PIOC_IFSR_P8
* @brief Input Filer Status */
#define PIOC_IFSR_P8		(1 << 8)

/* @def PIOC_IFSR_P7
* @brief Input Filer Status */
#define PIOC_IFSR_P7		(1 << 7)

/* @def PIOC_IFSR_P6
* @brief Input Filer Status */
#define PIOC_IFSR_P6		(1 << 6)

/* @def PIOC_IFSR_P5
* @brief Input Filer Status */
#define PIOC_IFSR_P5		(1 << 5)

/* @def PIOC_IFSR_P4
* @brief Input Filer Status */
#define PIOC_IFSR_P4		(1 << 4)

/* @def PIOC_IFSR_P3
* @brief Input Filer Status */
#define PIOC_IFSR_P3		(1 << 3)

/* @def PIOC_IFSR_P2
* @brief Input Filer Status */
#define PIOC_IFSR_P2		(1 << 2)

/* @def PIOC_IFSR_P1
* @brief Input Filer Status */
#define PIOC_IFSR_P1		(1 << 1)

/* @def PIOC_IFSR_P0
* @brief Input Filer Status */
#define PIOC_IFSR_P0		(1 << 0)

/* --- PIOC_SODR values --------------------------------------------- */


/* @def PIOC_SODR_P31
* @brief Set Output Data */
#define PIOC_SODR_P31		(1 << 31)

/* @def PIOC_SODR_P30
* @brief Set Output Data */
#define PIOC_SODR_P30		(1 << 30)

/* @def PIOC_SODR_P29
* @brief Set Output Data */
#define PIOC_SODR_P29		(1 << 29)

/* @def PIOC_SODR_P28
* @brief Set Output Data */
#define PIOC_SODR_P28		(1 << 28)

/* @def PIOC_SODR_P27
* @brief Set Output Data */
#define PIOC_SODR_P27		(1 << 27)

/* @def PIOC_SODR_P26
* @brief Set Output Data */
#define PIOC_SODR_P26		(1 << 26)

/* @def PIOC_SODR_P25
* @brief Set Output Data */
#define PIOC_SODR_P25		(1 << 25)

/* @def PIOC_SODR_P24
* @brief Set Output Data */
#define PIOC_SODR_P24		(1 << 24)

/* @def PIOC_SODR_P23
* @brief Set Output Data */
#define PIOC_SODR_P23		(1 << 23)

/* @def PIOC_SODR_P22
* @brief Set Output Data */
#define PIOC_SODR_P22		(1 << 22)

/* @def PIOC_SODR_P21
* @brief Set Output Data */
#define PIOC_SODR_P21		(1 << 21)

/* @def PIOC_SODR_P20
* @brief Set Output Data */
#define PIOC_SODR_P20		(1 << 20)

/* @def PIOC_SODR_P19
* @brief Set Output Data */
#define PIOC_SODR_P19		(1 << 19)

/* @def PIOC_SODR_P18
* @brief Set Output Data */
#define PIOC_SODR_P18		(1 << 18)

/* @def PIOC_SODR_P17
* @brief Set Output Data */
#define PIOC_SODR_P17		(1 << 17)

/* @def PIOC_SODR_P16
* @brief Set Output Data */
#define PIOC_SODR_P16		(1 << 16)

/* @def PIOC_SODR_P15
* @brief Set Output Data */
#define PIOC_SODR_P15		(1 << 15)

/* @def PIOC_SODR_P14
* @brief Set Output Data */
#define PIOC_SODR_P14		(1 << 14)

/* @def PIOC_SODR_P13
* @brief Set Output Data */
#define PIOC_SODR_P13		(1 << 13)

/* @def PIOC_SODR_P12
* @brief Set Output Data */
#define PIOC_SODR_P12		(1 << 12)

/* @def PIOC_SODR_P11
* @brief Set Output Data */
#define PIOC_SODR_P11		(1 << 11)

/* @def PIOC_SODR_P10
* @brief Set Output Data */
#define PIOC_SODR_P10		(1 << 10)

/* @def PIOC_SODR_P9
* @brief Set Output Data */
#define PIOC_SODR_P9		(1 << 9)

/* @def PIOC_SODR_P8
* @brief Set Output Data */
#define PIOC_SODR_P8		(1 << 8)

/* @def PIOC_SODR_P7
* @brief Set Output Data */
#define PIOC_SODR_P7		(1 << 7)

/* @def PIOC_SODR_P6
* @brief Set Output Data */
#define PIOC_SODR_P6		(1 << 6)

/* @def PIOC_SODR_P5
* @brief Set Output Data */
#define PIOC_SODR_P5		(1 << 5)

/* @def PIOC_SODR_P4
* @brief Set Output Data */
#define PIOC_SODR_P4		(1 << 4)

/* @def PIOC_SODR_P3
* @brief Set Output Data */
#define PIOC_SODR_P3		(1 << 3)

/* @def PIOC_SODR_P2
* @brief Set Output Data */
#define PIOC_SODR_P2		(1 << 2)

/* @def PIOC_SODR_P1
* @brief Set Output Data */
#define PIOC_SODR_P1		(1 << 1)

/* @def PIOC_SODR_P0
* @brief Set Output Data */
#define PIOC_SODR_P0		(1 << 0)

/* --- PIOC_CODR values --------------------------------------------- */


/* @def PIOC_CODR_P31
* @brief Clear Output Data */
#define PIOC_CODR_P31		(1 << 31)

/* @def PIOC_CODR_P30
* @brief Clear Output Data */
#define PIOC_CODR_P30		(1 << 30)

/* @def PIOC_CODR_P29
* @brief Clear Output Data */
#define PIOC_CODR_P29		(1 << 29)

/* @def PIOC_CODR_P28
* @brief Clear Output Data */
#define PIOC_CODR_P28		(1 << 28)

/* @def PIOC_CODR_P27
* @brief Clear Output Data */
#define PIOC_CODR_P27		(1 << 27)

/* @def PIOC_CODR_P26
* @brief Clear Output Data */
#define PIOC_CODR_P26		(1 << 26)

/* @def PIOC_CODR_P25
* @brief Clear Output Data */
#define PIOC_CODR_P25		(1 << 25)

/* @def PIOC_CODR_P24
* @brief Clear Output Data */
#define PIOC_CODR_P24		(1 << 24)

/* @def PIOC_CODR_P23
* @brief Clear Output Data */
#define PIOC_CODR_P23		(1 << 23)

/* @def PIOC_CODR_P22
* @brief Clear Output Data */
#define PIOC_CODR_P22		(1 << 22)

/* @def PIOC_CODR_P21
* @brief Clear Output Data */
#define PIOC_CODR_P21		(1 << 21)

/* @def PIOC_CODR_P20
* @brief Clear Output Data */
#define PIOC_CODR_P20		(1 << 20)

/* @def PIOC_CODR_P19
* @brief Clear Output Data */
#define PIOC_CODR_P19		(1 << 19)

/* @def PIOC_CODR_P18
* @brief Clear Output Data */
#define PIOC_CODR_P18		(1 << 18)

/* @def PIOC_CODR_P17
* @brief Clear Output Data */
#define PIOC_CODR_P17		(1 << 17)

