grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_CODR_P16
* @brief Clear Output Data */
#define PIOC_CODR_P16		(1 << 16)

/* @def PIOC_CODR_P15
* @brief Clear Output Data */
#define PIOC_CODR_P15		(1 << 15)

/* @def PIOC_CODR_P14
* @brief Clear Output Data */
#define PIOC_CODR_P14		(1 << 14)

/* @def PIOC_CODR_P13
* @brief Clear Output Data */
#define PIOC_CODR_P13		(1 << 13)

/* @def PIOC_CODR_P12
* @brief Clear Output Data */
#define PIOC_CODR_P12		(1 << 12)

/* @def PIOC_CODR_P11
* @brief Clear Output Data */
#define PIOC_CODR_P11		(1 << 11)

/* @def PIOC_CODR_P10
* @brief Clear Output Data */
#define PIOC_CODR_P10		(1 << 10)

/* @def PIOC_CODR_P9
* @brief Clear Output Data */
#define PIOC_CODR_P9		(1 << 9)

/* @def PIOC_CODR_P8
* @brief Clear Output Data */
#define PIOC_CODR_P8		(1 << 8)

/* @def PIOC_CODR_P7
* @brief Clear Output Data */
#define PIOC_CODR_P7		(1 << 7)

/* @def PIOC_CODR_P6
* @brief Clear Output Data */
#define PIOC_CODR_P6		(1 << 6)

/* @def PIOC_CODR_P5
* @brief Clear Output Data */
#define PIOC_CODR_P5		(1 << 5)

/* @def PIOC_CODR_P4
* @brief Clear Output Data */
#define PIOC_CODR_P4		(1 << 4)

/* @def PIOC_CODR_P3
* @brief Clear Output Data */
#define PIOC_CODR_P3		(1 << 3)

/* @def PIOC_CODR_P2
* @brief Clear Output Data */
#define PIOC_CODR_P2		(1 << 2)

/* @def PIOC_CODR_P1
* @brief Clear Output Data */
#define PIOC_CODR_P1		(1 << 1)

/* @def PIOC_CODR_P0
* @brief Clear Output Data */
#define PIOC_CODR_P0		(1 << 0)

/* --- PIOC_ODSR values --------------------------------------------- */


/* @def PIOC_ODSR_P31
* @brief Output Data Status */
#define PIOC_ODSR_P31		(1 << 31)

/* @def PIOC_ODSR_P30
* @brief Output Data Status */
#define PIOC_ODSR_P30		(1 << 30)

/* @def PIOC_ODSR_P29
* @brief Output Data Status */
#define PIOC_ODSR_P29		(1 << 29)

/* @def PIOC_ODSR_P28
* @brief Output Data Status */
#define PIOC_ODSR_P28		(1 << 28)

/* @def PIOC_ODSR_P27
* @brief Output Data Status */
#define PIOC_ODSR_P27		(1 << 27)

/* @def PIOC_ODSR_P26
* @brief Output Data Status */
#define PIOC_ODSR_P26		(1 << 26)

/* @def PIOC_ODSR_P25
* @brief Output Data Status */
#define PIOC_ODSR_P25		(1 << 25)

/* @def PIOC_ODSR_P24
* @brief Output Data Status */
#define PIOC_ODSR_P24		(1 << 24)

/* @def PIOC_ODSR_P23
* @brief Output Data Status */
#define PIOC_ODSR_P23		(1 << 23)

/* @def PIOC_ODSR_P22
* @brief Output Data Status */
#define PIOC_ODSR_P22		(1 << 22)

/* @def PIOC_ODSR_P21
* @brief Output Data Status */
#define PIOC_ODSR_P21		(1 << 21)

/* @def PIOC_ODSR_P20
* @brief Output Data Status */
#define PIOC_ODSR_P20		(1 << 20)

/* @def PIOC_ODSR_P19
* @brief Output Data Status */
#define PIOC_ODSR_P19		(1 << 19)

/* @def PIOC_ODSR_P18
* @brief Output Data Status */
#define PIOC_ODSR_P18		(1 << 18)

/* @def PIOC_ODSR_P17
* @brief Output Data Status */
#define PIOC_ODSR_P17		(1 << 17)

/* @def PIOC_ODSR_P16
* @brief Output Data Status */
#define PIOC_ODSR_P16		(1 << 16)

/* @def PIOC_ODSR_P15
* @brief Output Data Status */
#define PIOC_ODSR_P15		(1 << 15)

/* @def PIOC_ODSR_P14
* @brief Output Data Status */
#define PIOC_ODSR_P14		(1 << 14)

/* @def PIOC_ODSR_P13
* @brief Output Data Status */
#define PIOC_ODSR_P13		(1 << 13)

/* @def PIOC_ODSR_P12
* @brief Output Data Status */
#define PIOC_ODSR_P12		(1 << 12)

/* @def PIOC_ODSR_P11
* @brief Output Data Status */
#define PIOC_ODSR_P11		(1 << 11)

/* @def PIOC_ODSR_P10
* @brief Output Data Status */
#define PIOC_ODSR_P10		(1 << 10)

/* @def PIOC_ODSR_P9
* @brief Output Data Status */
#define PIOC_ODSR_P9		(1 << 9)

/* @def PIOC_ODSR_P8
* @brief Output Data Status */
#define PIOC_ODSR_P8		(1 << 8)

/* @def PIOC_ODSR_P7
* @brief Output Data Status */
#define PIOC_ODSR_P7		(1 << 7)

/* @def PIOC_ODSR_P6
* @brief Output Data Status */
#define PIOC_ODSR_P6		(1 << 6)

/* @def PIOC_ODSR_P5
* @brief Output Data Status */
#define PIOC_ODSR_P5		(1 << 5)

/* @def PIOC_ODSR_P4
* @brief Output Data Status */
#define PIOC_ODSR_P4		(1 << 4)

/* @def PIOC_ODSR_P3
* @brief Output Data Status */
#define PIOC_ODSR_P3		(1 << 3)

/* @def PIOC_ODSR_P2
* @brief Output Data Status */
#define PIOC_ODSR_P2		(1 << 2)

/* @def PIOC_ODSR_P1
* @brief Output Data Status */
#define PIOC_ODSR_P1		(1 << 1)

/* @def PIOC_ODSR_P0
* @brief Output Data Status */
#define PIOC_ODSR_P0		(1 << 0)

/* --- PIOC_PDSR values --------------------------------------------- */


/* @def PIOC_PDSR_P31
* @brief Output Data Status */
#define PIOC_PDSR_P31		(1 << 31)

/* @def PIOC_PDSR_P30
* @brief Output Data Status */
#define PIOC_PDSR_P30		(1 << 30)

/* @def PIOC_PDSR_P29
* @brief Output Data Status */
#define PIOC_PDSR_P29		(1 << 29)

/* @def PIOC_PDSR_P28
* @brief Output Data Status */
#define PIOC_PDSR_P28		(1 << 28)

/* @def PIOC_PDSR_P27
* @brief Output Data Status */
#define PIOC_PDSR_P27		(1 << 27)

/* @def PIOC_PDSR_P26
* @brief Output Data Status */
#define PIOC_PDSR_P26		(1 << 26)

/* @def PIOC_PDSR_P25
* @brief Output Data Status */
#define PIOC_PDSR_P25		(1 << 25)

/* @def PIOC_PDSR_P24
* @brief Output Data Status */
#define PIOC_PDSR_P24		(1 << 24)

/* @def PIOC_PDSR_P23
* @brief Output Data Status */
#define PIOC_PDSR_P23		(1 << 23)

/* @def PIOC_PDSR_P22
* @brief Output Data Status */
#define PIOC_PDSR_P22		(1 << 22)

/* @def PIOC_PDSR_P21
* @brief Output Data Status */
#define PIOC_PDSR_P21		(1 << 21)

/* @def PIOC_PDSR_P20
* @brief Output Data Status */
#define PIOC_PDSR_P20		(1 << 20)

/* @def PIOC_PDSR_P19
* @brief Output Data Status */
#define PIOC_PDSR_P19		(1 << 19)

/* @def PIOC_PDSR_P18
* @brief Output Data Status */
#define PIOC_PDSR_P18		(1 << 18)

/* @def PIOC_PDSR_P17
* @brief Output Data Status */
#define PIOC_PDSR_P17		(1 << 17)

/* @def PIOC_PDSR_P16
* @brief Output Data Status */
#define PIOC_PDSR_P16		(1 << 16)

/* @def PIOC_PDSR_P15
* @brief Output Data Status */
#define PIOC_PDSR_P15		(1 << 15)

/* @def PIOC_PDSR_P14
* @brief Output Data Status */
#define PIOC_PDSR_P14		(1 << 14)

/* @def PIOC_PDSR_P13
* @brief Output Data Status */
#define PIOC_PDSR_P13		(1 << 13)

/* @def PIOC_PDSR_P12
* @brief Output Data Status */
#define PIOC_PDSR_P12		(1 << 12)

/* @def PIOC_PDSR_P11
* @brief Output Data Status */
#define PIOC_PDSR_P11		(1 << 11)

