grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_PDSR_P10
* @brief Output Data Status */
#define PIOC_PDSR_P10		(1 << 10)

/* @def PIOC_PDSR_P9
* @brief Output Data Status */
#define PIOC_PDSR_P9		(1 << 9)

/* @def PIOC_PDSR_P8
* @brief Output Data Status */
#define PIOC_PDSR_P8		(1 << 8)

/* @def PIOC_PDSR_P7
* @brief Output Data Status */
#define PIOC_PDSR_P7		(1 << 7)

/* @def PIOC_PDSR_P6
* @brief Output Data Status */
#define PIOC_PDSR_P6		(1 << 6)

/* @def PIOC_PDSR_P5
* @brief Output Data Status */
#define PIOC_PDSR_P5		(1 << 5)

/* @def PIOC_PDSR_P4
* @brief Output Data Status */
#define PIOC_PDSR_P4		(1 << 4)

/* @def PIOC_PDSR_P3
* @brief Output Data Status */
#define PIOC_PDSR_P3		(1 << 3)

/* @def PIOC_PDSR_P2
* @brief Output Data Status */
#define PIOC_PDSR_P2		(1 << 2)

/* @def PIOC_PDSR_P1
* @brief Output Data Status */
#define PIOC_PDSR_P1		(1 << 1)

/* @def PIOC_PDSR_P0
* @brief Output Data Status */
#define PIOC_PDSR_P0		(1 << 0)

/* --- PIOC_IER values ---------------------------------------------- */


/* @def PIOC_IER_P31
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P31		(1 << 31)

/* @def PIOC_IER_P30
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P30		(1 << 30)

/* @def PIOC_IER_P29
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P29		(1 << 29)

/* @def PIOC_IER_P28
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P28		(1 << 28)

/* @def PIOC_IER_P27
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P27		(1 << 27)

/* @def PIOC_IER_P26
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P26		(1 << 26)

/* @def PIOC_IER_P25
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P25		(1 << 25)

/* @def PIOC_IER_P24
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P24		(1 << 24)

/* @def PIOC_IER_P23
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P23		(1 << 23)

/* @def PIOC_IER_P22
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P22		(1 << 22)

/* @def PIOC_IER_P21
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P21		(1 << 21)

/* @def PIOC_IER_P20
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P20		(1 << 20)

/* @def PIOC_IER_P19
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P19		(1 << 19)

/* @def PIOC_IER_P18
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P18		(1 << 18)

/* @def PIOC_IER_P17
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P17		(1 << 17)

/* @def PIOC_IER_P16
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P16		(1 << 16)

/* @def PIOC_IER_P15
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P15		(1 << 15)

/* @def PIOC_IER_P14
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P14		(1 << 14)

/* @def PIOC_IER_P13
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P13		(1 << 13)

/* @def PIOC_IER_P12
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P12		(1 << 12)

/* @def PIOC_IER_P11
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P11		(1 << 11)

/* @def PIOC_IER_P10
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P10		(1 << 10)

/* @def PIOC_IER_P9
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P9		(1 << 9)

/* @def PIOC_IER_P8
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P8		(1 << 8)

/* @def PIOC_IER_P7
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P7		(1 << 7)

/* @def PIOC_IER_P6
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P6		(1 << 6)

/* @def PIOC_IER_P5
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P5		(1 << 5)

/* @def PIOC_IER_P4
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P4		(1 << 4)

/* @def PIOC_IER_P3
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P3		(1 << 3)

/* @def PIOC_IER_P2
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P2		(1 << 2)

/* @def PIOC_IER_P1
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P1		(1 << 1)

/* @def PIOC_IER_P0
* @brief Input Change Interrupt Enable */
#define PIOC_IER_P0		(1 << 0)

/* --- PIOC_IDR values ---------------------------------------------- */


/* @def PIOC_IDR_P31
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P31		(1 << 31)

/* @def PIOC_IDR_P30
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P30		(1 << 30)

/* @def PIOC_IDR_P29
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P29		(1 << 29)

/* @def PIOC_IDR_P28
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P28		(1 << 28)

/* @def PIOC_IDR_P27
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P27		(1 << 27)

/* @def PIOC_IDR_P26
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P26		(1 << 26)

/* @def PIOC_IDR_P25
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P25		(1 << 25)

/* @def PIOC_IDR_P24
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P24		(1 << 24)

/* @def PIOC_IDR_P23
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P23		(1 << 23)

/* @def PIOC_IDR_P22
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P22		(1 << 22)

/* @def PIOC_IDR_P21
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P21		(1 << 21)

/* @def PIOC_IDR_P20
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P20		(1 << 20)

/* @def PIOC_IDR_P19
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P19		(1 << 19)

/* @def PIOC_IDR_P18
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P18		(1 << 18)

/* @def PIOC_IDR_P17
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P17		(1 << 17)

/* @def PIOC_IDR_P16
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P16		(1 << 16)

/* @def PIOC_IDR_P15
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P15		(1 << 15)

/* @def PIOC_IDR_P14
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P14		(1 << 14)

/* @def PIOC_IDR_P13
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P13		(1 << 13)

/* @def PIOC_IDR_P12
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P12		(1 << 12)

/* @def PIOC_IDR_P11
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P11		(1 << 11)

/* @def PIOC_IDR_P10
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P10		(1 << 10)

