grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_IDR_P9
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P9		(1 << 9)

/* @def PIOC_IDR_P8
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P8		(1 << 8)

/* @def PIOC_IDR_P7
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P7		(1 << 7)

/* @def PIOC_IDR_P6
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P6		(1 << 6)

/* @def PIOC_IDR_P5
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P5		(1 << 5)

/* @def PIOC_IDR_P4
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P4		(1 << 4)

/* @def PIOC_IDR_P3
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P3		(1 << 3)

/* @def PIOC_IDR_P2
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P2		(1 << 2)

/* @def PIOC_IDR_P1
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P1		(1 << 1)

/* @def PIOC_IDR_P0
* @brief Input Change Interrupt Disable */
#define PIOC_IDR_P0		(1 << 0)

/* --- PIOC_IMR values ---------------------------------------------- */


/* @def PIOC_IMR_P31
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P31		(1 << 31)

/* @def PIOC_IMR_P30
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P30		(1 << 30)

/* @def PIOC_IMR_P29
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P29		(1 << 29)

/* @def PIOC_IMR_P28
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P28		(1 << 28)

/* @def PIOC_IMR_P27
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P27		(1 << 27)

/* @def PIOC_IMR_P26
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P26		(1 << 26)

/* @def PIOC_IMR_P25
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P25		(1 << 25)

/* @def PIOC_IMR_P24
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P24		(1 << 24)

/* @def PIOC_IMR_P23
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P23		(1 << 23)

/* @def PIOC_IMR_P22
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P22		(1 << 22)

/* @def PIOC_IMR_P21
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P21		(1 << 21)

/* @def PIOC_IMR_P20
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P20		(1 << 20)

/* @def PIOC_IMR_P19
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P19		(1 << 19)

/* @def PIOC_IMR_P18
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P18		(1 << 18)

/* @def PIOC_IMR_P17
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P17		(1 << 17)

/* @def PIOC_IMR_P16
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P16		(1 << 16)

/* @def PIOC_IMR_P15
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P15		(1 << 15)

/* @def PIOC_IMR_P14
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P14		(1 << 14)

/* @def PIOC_IMR_P13
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P13		(1 << 13)

/* @def PIOC_IMR_P12
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P12		(1 << 12)

/* @def PIOC_IMR_P11
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P11		(1 << 11)

/* @def PIOC_IMR_P10
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P10		(1 << 10)

/* @def PIOC_IMR_P9
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P9		(1 << 9)

/* @def PIOC_IMR_P8
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P8		(1 << 8)

/* @def PIOC_IMR_P7
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P7		(1 << 7)

/* @def PIOC_IMR_P6
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P6		(1 << 6)

/* @def PIOC_IMR_P5
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P5		(1 << 5)

/* @def PIOC_IMR_P4
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P4		(1 << 4)

/* @def PIOC_IMR_P3
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P3		(1 << 3)

/* @def PIOC_IMR_P2
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P2		(1 << 2)

/* @def PIOC_IMR_P1
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P1		(1 << 1)

/* @def PIOC_IMR_P0
* @brief Input Change Interrupt Mask */
#define PIOC_IMR_P0		(1 << 0)

/* --- PIOC_ISR values ---------------------------------------------- */


/* @def PIOC_ISR_P31
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P31		(1 << 31)

/* @def PIOC_ISR_P30
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P30		(1 << 30)

/* @def PIOC_ISR_P29
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P29		(1 << 29)

/* @def PIOC_ISR_P28
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P28		(1 << 28)

/* @def PIOC_ISR_P27
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P27		(1 << 27)

/* @def PIOC_ISR_P26
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P26		(1 << 26)

/* @def PIOC_ISR_P25
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P25		(1 << 25)

/* @def PIOC_ISR_P24
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P24		(1 << 24)

/* @def PIOC_ISR_P23
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P23		(1 << 23)

/* @def PIOC_ISR_P22
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P22		(1 << 22)

/* @def PIOC_ISR_P21
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P21		(1 << 21)

/* @def PIOC_ISR_P20
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P20		(1 << 20)

/* @def PIOC_ISR_P19
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P19		(1 << 19)

/* @def PIOC_ISR_P18
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P18		(1 << 18)

/* @def PIOC_ISR_P17
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P17		(1 << 17)

/* @def PIOC_ISR_P16
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P16		(1 << 16)

/* @def PIOC_ISR_P15
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P15		(1 << 15)

/* @def PIOC_ISR_P14
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P14		(1 << 14)

/* @def PIOC_ISR_P13
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P13		(1 << 13)

/* @def PIOC_ISR_P12
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P12		(1 << 12)

/* @def PIOC_ISR_P11
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P11		(1 << 11)

