grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_ISR_P10
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P10		(1 << 10)

/* @def PIOC_ISR_P9
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P9		(1 << 9)

/* @def PIOC_ISR_P8
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P8		(1 << 8)

/* @def PIOC_ISR_P7
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P7		(1 << 7)

/* @def PIOC_ISR_P6
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P6		(1 << 6)

/* @def PIOC_ISR_P5
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P5		(1 << 5)

/* @def PIOC_ISR_P4
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P4		(1 << 4)

/* @def PIOC_ISR_P3
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P3		(1 << 3)

/* @def PIOC_ISR_P2
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P2		(1 << 2)

/* @def PIOC_ISR_P1
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P1		(1 << 1)

/* @def PIOC_ISR_P0
* @brief Input Change Interrupt Status */
#define PIOC_ISR_P0		(1 << 0)

/* --- PIOC_MDER values --------------------------------------------- */


/* @def PIOC_MDER_P31
* @brief Multi Drive Enable. */
#define PIOC_MDER_P31		(1 << 31)

/* @def PIOC_MDER_P30
* @brief Multi Drive Enable. */
#define PIOC_MDER_P30		(1 << 30)

/* @def PIOC_MDER_P29
* @brief Multi Drive Enable. */
#define PIOC_MDER_P29		(1 << 29)

/* @def PIOC_MDER_P28
* @brief Multi Drive Enable. */
#define PIOC_MDER_P28		(1 << 28)

/* @def PIOC_MDER_P27
* @brief Multi Drive Enable. */
#define PIOC_MDER_P27		(1 << 27)

/* @def PIOC_MDER_P26
* @brief Multi Drive Enable. */
#define PIOC_MDER_P26		(1 << 26)

/* @def PIOC_MDER_P25
* @brief Multi Drive Enable. */
#define PIOC_MDER_P25		(1 << 25)

/* @def PIOC_MDER_P24
* @brief Multi Drive Enable. */
#define PIOC_MDER_P24		(1 << 24)

/* @def PIOC_MDER_P23
* @brief Multi Drive Enable. */
#define PIOC_MDER_P23		(1 << 23)

/* @def PIOC_MDER_P22
* @brief Multi Drive Enable. */
#define PIOC_MDER_P22		(1 << 22)

/* @def PIOC_MDER_P21
* @brief Multi Drive Enable. */
#define PIOC_MDER_P21		(1 << 21)

/* @def PIOC_MDER_P20
* @brief Multi Drive Enable. */
#define PIOC_MDER_P20		(1 << 20)

/* @def PIOC_MDER_P19
* @brief Multi Drive Enable. */
#define PIOC_MDER_P19		(1 << 19)

/* @def PIOC_MDER_P18
* @brief Multi Drive Enable. */
#define PIOC_MDER_P18		(1 << 18)

/* @def PIOC_MDER_P17
* @brief Multi Drive Enable. */
#define PIOC_MDER_P17		(1 << 17)

/* @def PIOC_MDER_P16
* @brief Multi Drive Enable. */
#define PIOC_MDER_P16		(1 << 16)

/* @def PIOC_MDER_P15
* @brief Multi Drive Enable. */
#define PIOC_MDER_P15		(1 << 15)

/* @def PIOC_MDER_P14
* @brief Multi Drive Enable. */
#define PIOC_MDER_P14		(1 << 14)

/* @def PIOC_MDER_P13
* @brief Multi Drive Enable. */
#define PIOC_MDER_P13		(1 << 13)

/* @def PIOC_MDER_P12
* @brief Multi Drive Enable. */
#define PIOC_MDER_P12		(1 << 12)

/* @def PIOC_MDER_P11
* @brief Multi Drive Enable. */
#define PIOC_MDER_P11		(1 << 11)

/* @def PIOC_MDER_P10
* @brief Multi Drive Enable. */
#define PIOC_MDER_P10		(1 << 10)

/* @def PIOC_MDER_P9
* @brief Multi Drive Enable. */
#define PIOC_MDER_P9		(1 << 9)

/* @def PIOC_MDER_P8
* @brief Multi Drive Enable. */
#define PIOC_MDER_P8		(1 << 8)

/* @def PIOC_MDER_P7
* @brief Multi Drive Enable. */
#define PIOC_MDER_P7		(1 << 7)

/* @def PIOC_MDER_P6
* @brief Multi Drive Enable. */
#define PIOC_MDER_P6		(1 << 6)

/* @def PIOC_MDER_P5
* @brief Multi Drive Enable. */
#define PIOC_MDER_P5		(1 << 5)

/* @def PIOC_MDER_P4
* @brief Multi Drive Enable. */
#define PIOC_MDER_P4		(1 << 4)

/* @def PIOC_MDER_P3
* @brief Multi Drive Enable. */
#define PIOC_MDER_P3		(1 << 3)

/* @def PIOC_MDER_P2
* @brief Multi Drive Enable. */
#define PIOC_MDER_P2		(1 << 2)

/* @def PIOC_MDER_P1
* @brief Multi Drive Enable. */
#define PIOC_MDER_P1		(1 << 1)

/* @def PIOC_MDER_P0
* @brief Multi Drive Enable. */
#define PIOC_MDER_P0		(1 << 0)

/* --- PIOC_MDDR values --------------------------------------------- */


/* @def PIOC_MDDR_P31
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P31		(1 << 31)

/* @def PIOC_MDDR_P30
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P30		(1 << 30)

/* @def PIOC_MDDR_P29
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P29		(1 << 29)

/* @def PIOC_MDDR_P28
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P28		(1 << 28)

/* @def PIOC_MDDR_P27
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P27		(1 << 27)

/* @def PIOC_MDDR_P26
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P26		(1 << 26)

/* @def PIOC_MDDR_P25
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P25		(1 << 25)

/* @def PIOC_MDDR_P24
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P24		(1 << 24)

/* @def PIOC_MDDR_P23
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P23		(1 << 23)

/* @def PIOC_MDDR_P22
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P22		(1 << 22)

/* @def PIOC_MDDR_P21
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P21		(1 << 21)

/* @def PIOC_MDDR_P20
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P20		(1 << 20)

/* @def PIOC_MDDR_P19
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P19		(1 << 19)

/* @def PIOC_MDDR_P18
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P18		(1 << 18)

/* @def PIOC_MDDR_P17
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P17		(1 << 17)

/* @def PIOC_MDDR_P16
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P16		(1 << 16)

/* @def PIOC_MDDR_P15
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P15		(1 << 15)

/* @def PIOC_MDDR_P14
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P14		(1 << 14)

/* @def PIOC_MDDR_P13
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P13		(1 << 13)

/* @def PIOC_MDDR_P12
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P12		(1 << 12)

/* @def PIOC_MDDR_P11
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P11		(1 << 11)

/* @def PIOC_MDDR_P10
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P10		(1 << 10)

/* @def PIOC_MDDR_P9
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P9		(1 << 9)

/* @def PIOC_MDDR_P8
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P8		(1 << 8)

/* @def PIOC_MDDR_P7
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P7		(1 << 7)

/* @def PIOC_MDDR_P6
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P6		(1 << 6)

/* @def PIOC_MDDR_P5
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P5		(1 << 5)

/* @def PIOC_MDDR_P4
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P4		(1 << 4)

/* @def PIOC_MDDR_P3
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P3		(1 << 3)

