grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_MDDR_P2
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P2		(1 << 2)

/* @def PIOC_MDDR_P1
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P1		(1 << 1)

/* @def PIOC_MDDR_P0
* @brief Multi Drive Disable. */
#define PIOC_MDDR_P0		(1 << 0)

/* --- PIOC_MDSR values --------------------------------------------- */


/* @def PIOC_MDSR_P31
* @brief Multi Drive Status. */
#define PIOC_MDSR_P31		(1 << 31)

/* @def PIOC_MDSR_P30
* @brief Multi Drive Status. */
#define PIOC_MDSR_P30		(1 << 30)

/* @def PIOC_MDSR_P29
* @brief Multi Drive Status. */
#define PIOC_MDSR_P29		(1 << 29)

/* @def PIOC_MDSR_P28
* @brief Multi Drive Status. */
#define PIOC_MDSR_P28		(1 << 28)

/* @def PIOC_MDSR_P27
* @brief Multi Drive Status. */
#define PIOC_MDSR_P27		(1 << 27)

/* @def PIOC_MDSR_P26
* @brief Multi Drive Status. */
#define PIOC_MDSR_P26		(1 << 26)

/* @def PIOC_MDSR_P25
* @brief Multi Drive Status. */
#define PIOC_MDSR_P25		(1 << 25)

/* @def PIOC_MDSR_P24
* @brief Multi Drive Status. */
#define PIOC_MDSR_P24		(1 << 24)

/* @def PIOC_MDSR_P23
* @brief Multi Drive Status. */
#define PIOC_MDSR_P23		(1 << 23)

/* @def PIOC_MDSR_P22
* @brief Multi Drive Status. */
#define PIOC_MDSR_P22		(1 << 22)

/* @def PIOC_MDSR_P21
* @brief Multi Drive Status. */
#define PIOC_MDSR_P21		(1 << 21)

/* @def PIOC_MDSR_P20
* @brief Multi Drive Status. */
#define PIOC_MDSR_P20		(1 << 20)

/* @def PIOC_MDSR_P19
* @brief Multi Drive Status. */
#define PIOC_MDSR_P19		(1 << 19)

/* @def PIOC_MDSR_P18
* @brief Multi Drive Status. */
#define PIOC_MDSR_P18		(1 << 18)

/* @def PIOC_MDSR_P17
* @brief Multi Drive Status. */
#define PIOC_MDSR_P17		(1 << 17)

/* @def PIOC_MDSR_P16
* @brief Multi Drive Status. */
#define PIOC_MDSR_P16		(1 << 16)

/* @def PIOC_MDSR_P15
* @brief Multi Drive Status. */
#define PIOC_MDSR_P15		(1 << 15)

/* @def PIOC_MDSR_P14
* @brief Multi Drive Status. */
#define PIOC_MDSR_P14		(1 << 14)

/* @def PIOC_MDSR_P13
* @brief Multi Drive Status. */
#define PIOC_MDSR_P13		(1 << 13)

/* @def PIOC_MDSR_P12
* @brief Multi Drive Status. */
#define PIOC_MDSR_P12		(1 << 12)

/* @def PIOC_MDSR_P11
* @brief Multi Drive Status. */
#define PIOC_MDSR_P11		(1 << 11)

/* @def PIOC_MDSR_P10
* @brief Multi Drive Status. */
#define PIOC_MDSR_P10		(1 << 10)

/* @def PIOC_MDSR_P9
* @brief Multi Drive Status. */
#define PIOC_MDSR_P9		(1 << 9)

/* @def PIOC_MDSR_P8
* @brief Multi Drive Status. */
#define PIOC_MDSR_P8		(1 << 8)

/* @def PIOC_MDSR_P7
* @brief Multi Drive Status. */
#define PIOC_MDSR_P7		(1 << 7)

/* @def PIOC_MDSR_P6
* @brief Multi Drive Status. */
#define PIOC_MDSR_P6		(1 << 6)

/* @def PIOC_MDSR_P5
* @brief Multi Drive Status. */
#define PIOC_MDSR_P5		(1 << 5)

/* @def PIOC_MDSR_P4
* @brief Multi Drive Status. */
#define PIOC_MDSR_P4		(1 << 4)

/* @def PIOC_MDSR_P3
* @brief Multi Drive Status. */
#define PIOC_MDSR_P3		(1 << 3)

/* @def PIOC_MDSR_P2
* @brief Multi Drive Status. */
#define PIOC_MDSR_P2		(1 << 2)

/* @def PIOC_MDSR_P1
* @brief Multi Drive Status. */
#define PIOC_MDSR_P1		(1 << 1)

/* @def PIOC_MDSR_P0
* @brief Multi Drive Status. */
#define PIOC_MDSR_P0		(1 << 0)

/* --- PIOC_PUDR values --------------------------------------------- */


/* @def PIOC_PUDR_P31
* @brief Pull Up Disable. */
#define PIOC_PUDR_P31		(1 << 31)

/* @def PIOC_PUDR_P30
* @brief Pull Up Disable. */
#define PIOC_PUDR_P30		(1 << 30)

/* @def PIOC_PUDR_P29
* @brief Pull Up Disable. */
#define PIOC_PUDR_P29		(1 << 29)

/* @def PIOC_PUDR_P28
* @brief Pull Up Disable. */
#define PIOC_PUDR_P28		(1 << 28)

/* @def PIOC_PUDR_P27
* @brief Pull Up Disable. */
#define PIOC_PUDR_P27		(1 << 27)

/* @def PIOC_PUDR_P26
* @brief Pull Up Disable. */
#define PIOC_PUDR_P26		(1 << 26)

/* @def PIOC_PUDR_P25
* @brief Pull Up Disable. */
#define PIOC_PUDR_P25		(1 << 25)

/* @def PIOC_PUDR_P24
* @brief Pull Up Disable. */
#define PIOC_PUDR_P24		(1 << 24)

/* @def PIOC_PUDR_P23
* @brief Pull Up Disable. */
#define PIOC_PUDR_P23		(1 << 23)

/* @def PIOC_PUDR_P22
* @brief Pull Up Disable. */
#define PIOC_PUDR_P22		(1 << 22)

/* @def PIOC_PUDR_P21
* @brief Pull Up Disable. */
#define PIOC_PUDR_P21		(1 << 21)

/* @def PIOC_PUDR_P20
* @brief Pull Up Disable. */
#define PIOC_PUDR_P20		(1 << 20)

/* @def PIOC_PUDR_P19
* @brief Pull Up Disable. */
#define PIOC_PUDR_P19		(1 << 19)

/* @def PIOC_PUDR_P18
* @brief Pull Up Disable. */
#define PIOC_PUDR_P18		(1 << 18)

/* @def PIOC_PUDR_P17
* @brief Pull Up Disable. */
#define PIOC_PUDR_P17		(1 << 17)

/* @def PIOC_PUDR_P16
* @brief Pull Up Disable. */
#define PIOC_PUDR_P16		(1 << 16)

/* @def PIOC_PUDR_P15
* @brief Pull Up Disable. */
#define PIOC_PUDR_P15		(1 << 15)

/* @def PIOC_PUDR_P14
* @brief Pull Up Disable. */
#define PIOC_PUDR_P14		(1 << 14)

/* @def PIOC_PUDR_P13
* @brief Pull Up Disable. */
#define PIOC_PUDR_P13		(1 << 13)

/* @def PIOC_PUDR_P12
* @brief Pull Up Disable. */
#define PIOC_PUDR_P12		(1 << 12)

/* @def PIOC_PUDR_P11
* @brief Pull Up Disable. */
#define PIOC_PUDR_P11		(1 << 11)

/* @def PIOC_PUDR_P10
* @brief Pull Up Disable. */
#define PIOC_PUDR_P10		(1 << 10)

/* @def PIOC_PUDR_P9
* @brief Pull Up Disable. */
#define PIOC_PUDR_P9		(1 << 9)

/* @def PIOC_PUDR_P8
* @brief Pull Up Disable. */
#define PIOC_PUDR_P8		(1 << 8)

/* @def PIOC_PUDR_P7
* @brief Pull Up Disable. */
#define PIOC_PUDR_P7		(1 << 7)

/* @def PIOC_PUDR_P6
* @brief Pull Up Disable. */
#define PIOC_PUDR_P6		(1 << 6)

/* @def PIOC_PUDR_P5
* @brief Pull Up Disable. */
#define PIOC_PUDR_P5		(1 << 5)

/* @def PIOC_PUDR_P4
* @brief Pull Up Disable. */
#define PIOC_PUDR_P4		(1 << 4)

/* @def PIOC_PUDR_P3
* @brief Pull Up Disable. */
#define PIOC_PUDR_P3		(1 << 3)

/* @def PIOC_PUDR_P2
* @brief Pull Up Disable. */
#define PIOC_PUDR_P2		(1 << 2)

/* @def PIOC_PUDR_P1
* @brief Pull Up Disable. */
#define PIOC_PUDR_P1		(1 << 1)

/* @def PIOC_PUDR_P0
* @brief Pull Up Disable. */
#define PIOC_PUDR_P0		(1 << 0)

/* --- PIOC_PUER values --------------------------------------------- */


/* @def PIOC_PUER_P31
* @brief Pull Up Enable. */
#define PIOC_PUER_P31		(1 << 31)

/* @def PIOC_PUER_P30
* @brief Pull Up Enable. */
#define PIOC_PUER_P30		(1 << 30)

/* @def PIOC_PUER_P29
* @brief Pull Up Enable. */
#define PIOC_PUER_P29		(1 << 29)

/* @def PIOC_PUER_P28
* @brief Pull Up Enable. */
#define PIOC_PUER_P28		(1 << 28)

