grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_PUER_P27
* @brief Pull Up Enable. */
#define PIOC_PUER_P27		(1 << 27)

/* @def PIOC_PUER_P26
* @brief Pull Up Enable. */
#define PIOC_PUER_P26		(1 << 26)

/* @def PIOC_PUER_P25
* @brief Pull Up Enable. */
#define PIOC_PUER_P25		(1 << 25)

/* @def PIOC_PUER_P24
* @brief Pull Up Enable. */
#define PIOC_PUER_P24		(1 << 24)

/* @def PIOC_PUER_P23
* @brief Pull Up Enable. */
#define PIOC_PUER_P23		(1 << 23)

/* @def PIOC_PUER_P22
* @brief Pull Up Enable. */
#define PIOC_PUER_P22		(1 << 22)

/* @def PIOC_PUER_P21
* @brief Pull Up Enable. */
#define PIOC_PUER_P21		(1 << 21)

/* @def PIOC_PUER_P20
* @brief Pull Up Enable. */
#define PIOC_PUER_P20		(1 << 20)

/* @def PIOC_PUER_P19
* @brief Pull Up Enable. */
#define PIOC_PUER_P19		(1 << 19)

/* @def PIOC_PUER_P18
* @brief Pull Up Enable. */
#define PIOC_PUER_P18		(1 << 18)

/* @def PIOC_PUER_P17
* @brief Pull Up Enable. */
#define PIOC_PUER_P17		(1 << 17)

/* @def PIOC_PUER_P16
* @brief Pull Up Enable. */
#define PIOC_PUER_P16		(1 << 16)

/* @def PIOC_PUER_P15
* @brief Pull Up Enable. */
#define PIOC_PUER_P15		(1 << 15)

/* @def PIOC_PUER_P14
* @brief Pull Up Enable. */
#define PIOC_PUER_P14		(1 << 14)

/* @def PIOC_PUER_P13
* @brief Pull Up Enable. */
#define PIOC_PUER_P13		(1 << 13)

/* @def PIOC_PUER_P12
* @brief Pull Up Enable. */
#define PIOC_PUER_P12		(1 << 12)

/* @def PIOC_PUER_P11
* @brief Pull Up Enable. */
#define PIOC_PUER_P11		(1 << 11)

/* @def PIOC_PUER_P10
* @brief Pull Up Enable. */
#define PIOC_PUER_P10		(1 << 10)

/* @def PIOC_PUER_P9
* @brief Pull Up Enable. */
#define PIOC_PUER_P9		(1 << 9)

/* @def PIOC_PUER_P8
* @brief Pull Up Enable. */
#define PIOC_PUER_P8		(1 << 8)

/* @def PIOC_PUER_P7
* @brief Pull Up Enable. */
#define PIOC_PUER_P7		(1 << 7)

/* @def PIOC_PUER_P6
* @brief Pull Up Enable. */
#define PIOC_PUER_P6		(1 << 6)

/* @def PIOC_PUER_P5
* @brief Pull Up Enable. */
#define PIOC_PUER_P5		(1 << 5)

/* @def PIOC_PUER_P4
* @brief Pull Up Enable. */
#define PIOC_PUER_P4		(1 << 4)

/* @def PIOC_PUER_P3
* @brief Pull Up Enable. */
#define PIOC_PUER_P3		(1 << 3)

/* @def PIOC_PUER_P2
* @brief Pull Up Enable. */
#define PIOC_PUER_P2		(1 << 2)

/* @def PIOC_PUER_P1
* @brief Pull Up Enable. */
#define PIOC_PUER_P1		(1 << 1)

/* @def PIOC_PUER_P0
* @brief Pull Up Enable. */
#define PIOC_PUER_P0		(1 << 0)

/* --- PIOC_PUSR values --------------------------------------------- */


/* @def PIOC_PUSR_P31
* @brief Pull Up Status. */
#define PIOC_PUSR_P31		(1 << 31)

/* @def PIOC_PUSR_P30
* @brief Pull Up Status. */
#define PIOC_PUSR_P30		(1 << 30)

/* @def PIOC_PUSR_P29
* @brief Pull Up Status. */
#define PIOC_PUSR_P29		(1 << 29)

/* @def PIOC_PUSR_P28
* @brief Pull Up Status. */
#define PIOC_PUSR_P28		(1 << 28)

/* @def PIOC_PUSR_P27
* @brief Pull Up Status. */
#define PIOC_PUSR_P27		(1 << 27)

/* @def PIOC_PUSR_P26
* @brief Pull Up Status. */
#define PIOC_PUSR_P26		(1 << 26)

/* @def PIOC_PUSR_P25
* @brief Pull Up Status. */
#define PIOC_PUSR_P25		(1 << 25)

/* @def PIOC_PUSR_P24
* @brief Pull Up Status. */
#define PIOC_PUSR_P24		(1 << 24)

/* @def PIOC_PUSR_P23
* @brief Pull Up Status. */
#define PIOC_PUSR_P23		(1 << 23)

/* @def PIOC_PUSR_P22
* @brief Pull Up Status. */
#define PIOC_PUSR_P22		(1 << 22)

/* @def PIOC_PUSR_P21
* @brief Pull Up Status. */
#define PIOC_PUSR_P21		(1 << 21)

/* @def PIOC_PUSR_P20
* @brief Pull Up Status. */
#define PIOC_PUSR_P20		(1 << 20)

/* @def PIOC_PUSR_P19
* @brief Pull Up Status. */
#define PIOC_PUSR_P19		(1 << 19)

/* @def PIOC_PUSR_P18
* @brief Pull Up Status. */
#define PIOC_PUSR_P18		(1 << 18)

/* @def PIOC_PUSR_P17
* @brief Pull Up Status. */
#define PIOC_PUSR_P17		(1 << 17)

/* @def PIOC_PUSR_P16
* @brief Pull Up Status. */
#define PIOC_PUSR_P16		(1 << 16)

/* @def PIOC_PUSR_P15
* @brief Pull Up Status. */
#define PIOC_PUSR_P15		(1 << 15)

/* @def PIOC_PUSR_P14
* @brief Pull Up Status. */
#define PIOC_PUSR_P14		(1 << 14)

/* @def PIOC_PUSR_P13
* @brief Pull Up Status. */
#define PIOC_PUSR_P13		(1 << 13)

/* @def PIOC_PUSR_P12
* @brief Pull Up Status. */
#define PIOC_PUSR_P12		(1 << 12)

/* @def PIOC_PUSR_P11
* @brief Pull Up Status. */
#define PIOC_PUSR_P11		(1 << 11)

/* @def PIOC_PUSR_P10
* @brief Pull Up Status. */
#define PIOC_PUSR_P10		(1 << 10)

/* @def PIOC_PUSR_P9
* @brief Pull Up Status. */
#define PIOC_PUSR_P9		(1 << 9)

/* @def PIOC_PUSR_P8
* @brief Pull Up Status. */
#define PIOC_PUSR_P8		(1 << 8)

/* @def PIOC_PUSR_P7
* @brief Pull Up Status. */
#define PIOC_PUSR_P7		(1 << 7)

/* @def PIOC_PUSR_P6
* @brief Pull Up Status. */
#define PIOC_PUSR_P6		(1 << 6)

/* @def PIOC_PUSR_P5
* @brief Pull Up Status. */
#define PIOC_PUSR_P5		(1 << 5)

/* @def PIOC_PUSR_P4
* @brief Pull Up Status. */
#define PIOC_PUSR_P4		(1 << 4)

/* @def PIOC_PUSR_P3
* @brief Pull Up Status. */
#define PIOC_PUSR_P3		(1 << 3)

/* @def PIOC_PUSR_P2
* @brief Pull Up Status. */
#define PIOC_PUSR_P2		(1 << 2)

/* @def PIOC_PUSR_P1
* @brief Pull Up Status. */
#define PIOC_PUSR_P1		(1 << 1)

/* @def PIOC_PUSR_P0
* @brief Pull Up Status. */
#define PIOC_PUSR_P0		(1 << 0)

/* --- PIOC_ABCDSR[0] values ---------------------------------------- */


/* @def PIOC_ABCDSR[0]_P31
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P31		(1 << 31)

/* @def PIOC_ABCDSR[0]_P30
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P30		(1 << 30)

/* @def PIOC_ABCDSR[0]_P29
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P29		(1 << 29)

/* @def PIOC_ABCDSR[0]_P28
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P28		(1 << 28)

/* @def PIOC_ABCDSR[0]_P27
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P27		(1 << 27)

/* @def PIOC_ABCDSR[0]_P26
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P26		(1 << 26)

/* @def PIOC_ABCDSR[0]_P25
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P25		(1 << 25)

/* @def PIOC_ABCDSR[0]_P24
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P24		(1 << 24)

/* @def PIOC_ABCDSR[0]_P23
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P23		(1 << 23)

/* @def PIOC_ABCDSR[0]_P22
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P22		(1 << 22)

/* @def PIOC_ABCDSR[0]_P21
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P21		(1 << 21)

/* @def PIOC_ABCDSR[0]_P20
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P20		(1 << 20)

/* @def PIOC_ABCDSR[0]_P19
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P19		(1 << 19)

