grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_ABCDSR[0]_P18
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P18		(1 << 18)

/* @def PIOC_ABCDSR[0]_P17
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P17		(1 << 17)

/* @def PIOC_ABCDSR[0]_P16
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P16		(1 << 16)

/* @def PIOC_ABCDSR[0]_P15
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P15		(1 << 15)

/* @def PIOC_ABCDSR[0]_P14
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P14		(1 << 14)

/* @def PIOC_ABCDSR[0]_P13
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P13		(1 << 13)

/* @def PIOC_ABCDSR[0]_P12
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P12		(1 << 12)

/* @def PIOC_ABCDSR[0]_P11
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P11		(1 << 11)

/* @def PIOC_ABCDSR[0]_P10
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P10		(1 << 10)

/* @def PIOC_ABCDSR[0]_P9
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P9		(1 << 9)

/* @def PIOC_ABCDSR[0]_P8
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P8		(1 << 8)

/* @def PIOC_ABCDSR[0]_P7
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P7		(1 << 7)

/* @def PIOC_ABCDSR[0]_P6
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P6		(1 << 6)

/* @def PIOC_ABCDSR[0]_P5
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P5		(1 << 5)

/* @def PIOC_ABCDSR[0]_P4
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P4		(1 << 4)

/* @def PIOC_ABCDSR[0]_P3
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P3		(1 << 3)

/* @def PIOC_ABCDSR[0]_P2
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P2		(1 << 2)

/* @def PIOC_ABCDSR[0]_P1
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P1		(1 << 1)

/* @def PIOC_ABCDSR[0]_P0
* @brief Peripheral Select. */
#define PIOC_ABCDSR[0]_P0		(1 << 0)

/* --- PIOC_ABCDSR[1] values ---------------------------------------- */


/* @def PIOC_ABCDSR[1]_P31
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P31		(1 << 31)

/* @def PIOC_ABCDSR[1]_P30
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P30		(1 << 30)

/* @def PIOC_ABCDSR[1]_P29
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P29		(1 << 29)

/* @def PIOC_ABCDSR[1]_P28
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P28		(1 << 28)

/* @def PIOC_ABCDSR[1]_P27
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P27		(1 << 27)

/* @def PIOC_ABCDSR[1]_P26
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P26		(1 << 26)

/* @def PIOC_ABCDSR[1]_P25
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P25		(1 << 25)

/* @def PIOC_ABCDSR[1]_P24
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P24		(1 << 24)

/* @def PIOC_ABCDSR[1]_P23
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P23		(1 << 23)

/* @def PIOC_ABCDSR[1]_P22
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P22		(1 << 22)

/* @def PIOC_ABCDSR[1]_P21
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P21		(1 << 21)

/* @def PIOC_ABCDSR[1]_P20
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P20		(1 << 20)

/* @def PIOC_ABCDSR[1]_P19
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P19		(1 << 19)

/* @def PIOC_ABCDSR[1]_P18
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P18		(1 << 18)

/* @def PIOC_ABCDSR[1]_P17
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P17		(1 << 17)

/* @def PIOC_ABCDSR[1]_P16
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P16		(1 << 16)

/* @def PIOC_ABCDSR[1]_P15
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P15		(1 << 15)

/* @def PIOC_ABCDSR[1]_P14
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P14		(1 << 14)

/* @def PIOC_ABCDSR[1]_P13
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P13		(1 << 13)

/* @def PIOC_ABCDSR[1]_P12
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P12		(1 << 12)

/* @def PIOC_ABCDSR[1]_P11
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P11		(1 << 11)

/* @def PIOC_ABCDSR[1]_P10
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P10		(1 << 10)

/* @def PIOC_ABCDSR[1]_P9
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P9		(1 << 9)

/* @def PIOC_ABCDSR[1]_P8
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P8		(1 << 8)

/* @def PIOC_ABCDSR[1]_P7
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P7		(1 << 7)

/* @def PIOC_ABCDSR[1]_P6
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P6		(1 << 6)

/* @def PIOC_ABCDSR[1]_P5
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P5		(1 << 5)

/* @def PIOC_ABCDSR[1]_P4
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P4		(1 << 4)

/* @def PIOC_ABCDSR[1]_P3
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P3		(1 << 3)

/* @def PIOC_ABCDSR[1]_P2
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P2		(1 << 2)

/* @def PIOC_ABCDSR[1]_P1
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P1		(1 << 1)

/* @def PIOC_ABCDSR[1]_P0
* @brief Peripheral Select. */
#define PIOC_ABCDSR[1]_P0		(1 << 0)

/* --- PIOC_IFSCDR values ------------------------------------------- */


/* @def PIOC_IFSCDR_P31
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P31		(1 << 31)

/* @def PIOC_IFSCDR_P30
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P30		(1 << 30)

/* @def PIOC_IFSCDR_P29
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P29		(1 << 29)

/* @def PIOC_IFSCDR_P28
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P28		(1 << 28)

/* @def PIOC_IFSCDR_P27
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P27		(1 << 27)

/* @def PIOC_IFSCDR_P26
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P26		(1 << 26)

/* @def PIOC_IFSCDR_P25
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P25		(1 << 25)

/* @def PIOC_IFSCDR_P24
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P24		(1 << 24)

/* @def PIOC_IFSCDR_P23
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P23		(1 << 23)

/* @def PIOC_IFSCDR_P22
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P22		(1 << 22)

