grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_IFSCDR_P21
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P21		(1 << 21)

/* @def PIOC_IFSCDR_P20
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P20		(1 << 20)

/* @def PIOC_IFSCDR_P19
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P19		(1 << 19)

/* @def PIOC_IFSCDR_P18
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P18		(1 << 18)

/* @def PIOC_IFSCDR_P17
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P17		(1 << 17)

/* @def PIOC_IFSCDR_P16
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P16		(1 << 16)

/* @def PIOC_IFSCDR_P15
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P15		(1 << 15)

/* @def PIOC_IFSCDR_P14
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P14		(1 << 14)

/* @def PIOC_IFSCDR_P13
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P13		(1 << 13)

/* @def PIOC_IFSCDR_P12
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P12		(1 << 12)

/* @def PIOC_IFSCDR_P11
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P11		(1 << 11)

/* @def PIOC_IFSCDR_P10
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P10		(1 << 10)

/* @def PIOC_IFSCDR_P9
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P9		(1 << 9)

/* @def PIOC_IFSCDR_P8
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P8		(1 << 8)

/* @def PIOC_IFSCDR_P7
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P7		(1 << 7)

/* @def PIOC_IFSCDR_P6
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P6		(1 << 6)

/* @def PIOC_IFSCDR_P5
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P5		(1 << 5)

/* @def PIOC_IFSCDR_P4
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P4		(1 << 4)

/* @def PIOC_IFSCDR_P3
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P3		(1 << 3)

/* @def PIOC_IFSCDR_P2
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P2		(1 << 2)

/* @def PIOC_IFSCDR_P1
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P1		(1 << 1)

/* @def PIOC_IFSCDR_P0
* @brief PIO Clock Glitch Filtering Select. */
#define PIOC_IFSCDR_P0		(1 << 0)

/* --- PIOC_IFSCER values ------------------------------------------- */


/* @def PIOC_IFSCER_P31
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P31		(1 << 31)

/* @def PIOC_IFSCER_P30
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P30		(1 << 30)

/* @def PIOC_IFSCER_P29
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P29		(1 << 29)

/* @def PIOC_IFSCER_P28
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P28		(1 << 28)

/* @def PIOC_IFSCER_P27
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P27		(1 << 27)

/* @def PIOC_IFSCER_P26
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P26		(1 << 26)

/* @def PIOC_IFSCER_P25
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P25		(1 << 25)

/* @def PIOC_IFSCER_P24
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P24		(1 << 24)

/* @def PIOC_IFSCER_P23
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P23		(1 << 23)

/* @def PIOC_IFSCER_P22
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P22		(1 << 22)

/* @def PIOC_IFSCER_P21
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P21		(1 << 21)

/* @def PIOC_IFSCER_P20
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P20		(1 << 20)

/* @def PIOC_IFSCER_P19
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P19		(1 << 19)

/* @def PIOC_IFSCER_P18
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P18		(1 << 18)

/* @def PIOC_IFSCER_P17
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P17		(1 << 17)

/* @def PIOC_IFSCER_P16
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P16		(1 << 16)

/* @def PIOC_IFSCER_P15
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P15		(1 << 15)

/* @def PIOC_IFSCER_P14
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P14		(1 << 14)

/* @def PIOC_IFSCER_P13
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P13		(1 << 13)

/* @def PIOC_IFSCER_P12
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P12		(1 << 12)

/* @def PIOC_IFSCER_P11
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P11		(1 << 11)

/* @def PIOC_IFSCER_P10
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P10		(1 << 10)

/* @def PIOC_IFSCER_P9
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P9		(1 << 9)

/* @def PIOC_IFSCER_P8
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P8		(1 << 8)

/* @def PIOC_IFSCER_P7
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P7		(1 << 7)

/* @def PIOC_IFSCER_P6
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P6		(1 << 6)

/* @def PIOC_IFSCER_P5
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P5		(1 << 5)

/* @def PIOC_IFSCER_P4
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P4		(1 << 4)

/* @def PIOC_IFSCER_P3
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P3		(1 << 3)

/* @def PIOC_IFSCER_P2
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P2		(1 << 2)

/* @def PIOC_IFSCER_P1
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P1		(1 << 1)

/* @def PIOC_IFSCER_P0
* @brief Debouncing Filtering Select. */
#define PIOC_IFSCER_P0		(1 << 0)

/* --- PIOC_IFSCSR values ------------------------------------------- */


/* @def PIOC_IFSCSR_P31
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P31		(1 << 31)

/* @def PIOC_IFSCSR_P30
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P30		(1 << 30)

/* @def PIOC_IFSCSR_P29
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P29		(1 << 29)

/* @def PIOC_IFSCSR_P28
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P28		(1 << 28)

/* @def PIOC_IFSCSR_P27
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P27		(1 << 27)

