grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_IFSCSR_P26
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P26		(1 << 26)

/* @def PIOC_IFSCSR_P25
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P25		(1 << 25)

/* @def PIOC_IFSCSR_P24
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P24		(1 << 24)

/* @def PIOC_IFSCSR_P23
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P23		(1 << 23)

/* @def PIOC_IFSCSR_P22
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P22		(1 << 22)

/* @def PIOC_IFSCSR_P21
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P21		(1 << 21)

/* @def PIOC_IFSCSR_P20
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P20		(1 << 20)

/* @def PIOC_IFSCSR_P19
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P19		(1 << 19)

/* @def PIOC_IFSCSR_P18
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P18		(1 << 18)

/* @def PIOC_IFSCSR_P17
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P17		(1 << 17)

/* @def PIOC_IFSCSR_P16
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P16		(1 << 16)

/* @def PIOC_IFSCSR_P15
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P15		(1 << 15)

/* @def PIOC_IFSCSR_P14
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P14		(1 << 14)

/* @def PIOC_IFSCSR_P13
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P13		(1 << 13)

/* @def PIOC_IFSCSR_P12
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P12		(1 << 12)

/* @def PIOC_IFSCSR_P11
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P11		(1 << 11)

/* @def PIOC_IFSCSR_P10
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P10		(1 << 10)

/* @def PIOC_IFSCSR_P9
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P9		(1 << 9)

/* @def PIOC_IFSCSR_P8
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P8		(1 << 8)

/* @def PIOC_IFSCSR_P7
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P7		(1 << 7)

/* @def PIOC_IFSCSR_P6
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P6		(1 << 6)

/* @def PIOC_IFSCSR_P5
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P5		(1 << 5)

/* @def PIOC_IFSCSR_P4
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P4		(1 << 4)

/* @def PIOC_IFSCSR_P3
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P3		(1 << 3)

/* @def PIOC_IFSCSR_P2
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P2		(1 << 2)

/* @def PIOC_IFSCSR_P1
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P1		(1 << 1)

/* @def PIOC_IFSCSR_P0
* @brief Glitch or Debouncing Filter Selection Status */
#define PIOC_IFSCSR_P0		(1 << 0)

/* --- PIOC_SCDR values --------------------------------------------- */


/* @def PIOC_SCDR_DIV
* @brief  */
#define PIOC_SCDR_DIV_SHIFT		0
#define PIOC_SCDR_DIV_MASK		0x3fff
/** @defgroup pioc_scdr_div DIV
* @brief 
@{*/
/*@}*/

/* --- PIOC_PPDDR values -------------------------------------------- */


/* @def PIOC_PPDDR_P31
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P31		(1 << 31)

/* @def PIOC_PPDDR_P30
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P30		(1 << 30)

/* @def PIOC_PPDDR_P29
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P29		(1 << 29)

/* @def PIOC_PPDDR_P28
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P28		(1 << 28)

/* @def PIOC_PPDDR_P27
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P27		(1 << 27)

/* @def PIOC_PPDDR_P26
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P26		(1 << 26)

/* @def PIOC_PPDDR_P25
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P25		(1 << 25)

/* @def PIOC_PPDDR_P24
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P24		(1 << 24)

/* @def PIOC_PPDDR_P23
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P23		(1 << 23)

/* @def PIOC_PPDDR_P22
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P22		(1 << 22)

/* @def PIOC_PPDDR_P21
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P21		(1 << 21)

/* @def PIOC_PPDDR_P20
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P20		(1 << 20)

/* @def PIOC_PPDDR_P19
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P19		(1 << 19)

/* @def PIOC_PPDDR_P18
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P18		(1 << 18)

/* @def PIOC_PPDDR_P17
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P17		(1 << 17)

/* @def PIOC_PPDDR_P16
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P16		(1 << 16)

/* @def PIOC_PPDDR_P15
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P15		(1 << 15)

/* @def PIOC_PPDDR_P14
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P14		(1 << 14)

/* @def PIOC_PPDDR_P13
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P13		(1 << 13)

/* @def PIOC_PPDDR_P12
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P12		(1 << 12)

/* @def PIOC_PPDDR_P11
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P11		(1 << 11)

/* @def PIOC_PPDDR_P10
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P10		(1 << 10)

/* @def PIOC_PPDDR_P9
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P9		(1 << 9)

/* @def PIOC_PPDDR_P8
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P8		(1 << 8)

/* @def PIOC_PPDDR_P7
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P7		(1 << 7)

/* @def PIOC_PPDDR_P6
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P6		(1 << 6)

/* @def PIOC_PPDDR_P5
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P5		(1 << 5)

/* @def PIOC_PPDDR_P4
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P4		(1 << 4)

/* @def PIOC_PPDDR_P3
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P3		(1 << 3)

/* @def PIOC_PPDDR_P2
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P2		(1 << 2)

