grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_PPDDR_P1
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P1		(1 << 1)

/* @def PIOC_PPDDR_P0
* @brief Pull Down Disable. */
#define PIOC_PPDDR_P0		(1 << 0)

/* --- PIOC_PPDER values -------------------------------------------- */


/* @def PIOC_PPDER_P31
* @brief Pull Down Enable. */
#define PIOC_PPDER_P31		(1 << 31)

/* @def PIOC_PPDER_P30
* @brief Pull Down Enable. */
#define PIOC_PPDER_P30		(1 << 30)

/* @def PIOC_PPDER_P29
* @brief Pull Down Enable. */
#define PIOC_PPDER_P29		(1 << 29)

/* @def PIOC_PPDER_P28
* @brief Pull Down Enable. */
#define PIOC_PPDER_P28		(1 << 28)

/* @def PIOC_PPDER_P27
* @brief Pull Down Enable. */
#define PIOC_PPDER_P27		(1 << 27)

/* @def PIOC_PPDER_P26
* @brief Pull Down Enable. */
#define PIOC_PPDER_P26		(1 << 26)

/* @def PIOC_PPDER_P25
* @brief Pull Down Enable. */
#define PIOC_PPDER_P25		(1 << 25)

/* @def PIOC_PPDER_P24
* @brief Pull Down Enable. */
#define PIOC_PPDER_P24		(1 << 24)

/* @def PIOC_PPDER_P23
* @brief Pull Down Enable. */
#define PIOC_PPDER_P23		(1 << 23)

/* @def PIOC_PPDER_P22
* @brief Pull Down Enable. */
#define PIOC_PPDER_P22		(1 << 22)

/* @def PIOC_PPDER_P21
* @brief Pull Down Enable. */
#define PIOC_PPDER_P21		(1 << 21)

/* @def PIOC_PPDER_P20
* @brief Pull Down Enable. */
#define PIOC_PPDER_P20		(1 << 20)

/* @def PIOC_PPDER_P19
* @brief Pull Down Enable. */
#define PIOC_PPDER_P19		(1 << 19)

/* @def PIOC_PPDER_P18
* @brief Pull Down Enable. */
#define PIOC_PPDER_P18		(1 << 18)

/* @def PIOC_PPDER_P17
* @brief Pull Down Enable. */
#define PIOC_PPDER_P17		(1 << 17)

/* @def PIOC_PPDER_P16
* @brief Pull Down Enable. */
#define PIOC_PPDER_P16		(1 << 16)

/* @def PIOC_PPDER_P15
* @brief Pull Down Enable. */
#define PIOC_PPDER_P15		(1 << 15)

/* @def PIOC_PPDER_P14
* @brief Pull Down Enable. */
#define PIOC_PPDER_P14		(1 << 14)

/* @def PIOC_PPDER_P13
* @brief Pull Down Enable. */
#define PIOC_PPDER_P13		(1 << 13)

/* @def PIOC_PPDER_P12
* @brief Pull Down Enable. */
#define PIOC_PPDER_P12		(1 << 12)

/* @def PIOC_PPDER_P11
* @brief Pull Down Enable. */
#define PIOC_PPDER_P11		(1 << 11)

/* @def PIOC_PPDER_P10
* @brief Pull Down Enable. */
#define PIOC_PPDER_P10		(1 << 10)

/* @def PIOC_PPDER_P9
* @brief Pull Down Enable. */
#define PIOC_PPDER_P9		(1 << 9)

/* @def PIOC_PPDER_P8
* @brief Pull Down Enable. */
#define PIOC_PPDER_P8		(1 << 8)

/* @def PIOC_PPDER_P7
* @brief Pull Down Enable. */
#define PIOC_PPDER_P7		(1 << 7)

/* @def PIOC_PPDER_P6
* @brief Pull Down Enable. */
#define PIOC_PPDER_P6		(1 << 6)

/* @def PIOC_PPDER_P5
* @brief Pull Down Enable. */
#define PIOC_PPDER_P5		(1 << 5)

/* @def PIOC_PPDER_P4
* @brief Pull Down Enable. */
#define PIOC_PPDER_P4		(1 << 4)

/* @def PIOC_PPDER_P3
* @brief Pull Down Enable. */
#define PIOC_PPDER_P3		(1 << 3)

/* @def PIOC_PPDER_P2
* @brief Pull Down Enable. */
#define PIOC_PPDER_P2		(1 << 2)

/* @def PIOC_PPDER_P1
* @brief Pull Down Enable. */
#define PIOC_PPDER_P1		(1 << 1)

/* @def PIOC_PPDER_P0
* @brief Pull Down Enable. */
#define PIOC_PPDER_P0		(1 << 0)

/* --- PIOC_PPDSR values -------------------------------------------- */


/* @def PIOC_PPDSR_P31
* @brief Pull Down Status. */
#define PIOC_PPDSR_P31		(1 << 31)

/* @def PIOC_PPDSR_P30
* @brief Pull Down Status. */
#define PIOC_PPDSR_P30		(1 << 30)

/* @def PIOC_PPDSR_P29
* @brief Pull Down Status. */
#define PIOC_PPDSR_P29		(1 << 29)

/* @def PIOC_PPDSR_P28
* @brief Pull Down Status. */
#define PIOC_PPDSR_P28		(1 << 28)

/* @def PIOC_PPDSR_P27
* @brief Pull Down Status. */
#define PIOC_PPDSR_P27		(1 << 27)

/* @def PIOC_PPDSR_P26
* @brief Pull Down Status. */
#define PIOC_PPDSR_P26		(1 << 26)

/* @def PIOC_PPDSR_P25
* @brief Pull Down Status. */
#define PIOC_PPDSR_P25		(1 << 25)

/* @def PIOC_PPDSR_P24
* @brief Pull Down Status. */
#define PIOC_PPDSR_P24		(1 << 24)

/* @def PIOC_PPDSR_P23
* @brief Pull Down Status. */
#define PIOC_PPDSR_P23		(1 << 23)

/* @def PIOC_PPDSR_P22
* @brief Pull Down Status. */
#define PIOC_PPDSR_P22		(1 << 22)

/* @def PIOC_PPDSR_P21
* @brief Pull Down Status. */
#define PIOC_PPDSR_P21		(1 << 21)

/* @def PIOC_PPDSR_P20
* @brief Pull Down Status. */
#define PIOC_PPDSR_P20		(1 << 20)

/* @def PIOC_PPDSR_P19
* @brief Pull Down Status. */
#define PIOC_PPDSR_P19		(1 << 19)

/* @def PIOC_PPDSR_P18
* @brief Pull Down Status. */
#define PIOC_PPDSR_P18		(1 << 18)

/* @def PIOC_PPDSR_P17
* @brief Pull Down Status. */
#define PIOC_PPDSR_P17		(1 << 17)

/* @def PIOC_PPDSR_P16
* @brief Pull Down Status. */
#define PIOC_PPDSR_P16		(1 << 16)

/* @def PIOC_PPDSR_P15
* @brief Pull Down Status. */
#define PIOC_PPDSR_P15		(1 << 15)

/* @def PIOC_PPDSR_P14
* @brief Pull Down Status. */
#define PIOC_PPDSR_P14		(1 << 14)

/* @def PIOC_PPDSR_P13
* @brief Pull Down Status. */
#define PIOC_PPDSR_P13		(1 << 13)

/* @def PIOC_PPDSR_P12
* @brief Pull Down Status. */
#define PIOC_PPDSR_P12		(1 << 12)

/* @def PIOC_PPDSR_P11
* @brief Pull Down Status. */
#define PIOC_PPDSR_P11		(1 << 11)

/* @def PIOC_PPDSR_P10
* @brief Pull Down Status. */
#define PIOC_PPDSR_P10		(1 << 10)

/* @def PIOC_PPDSR_P9
* @brief Pull Down Status. */
#define PIOC_PPDSR_P9		(1 << 9)

/* @def PIOC_PPDSR_P8
* @brief Pull Down Status. */
#define PIOC_PPDSR_P8		(1 << 8)

/* @def PIOC_PPDSR_P7
* @brief Pull Down Status. */
#define PIOC_PPDSR_P7		(1 << 7)

/* @def PIOC_PPDSR_P6
* @brief Pull Down Status. */
#define PIOC_PPDSR_P6		(1 << 6)

/* @def PIOC_PPDSR_P5
* @brief Pull Down Status. */
#define PIOC_PPDSR_P5		(1 << 5)

/* @def PIOC_PPDSR_P4
* @brief Pull Down Status. */
#define PIOC_PPDSR_P4		(1 << 4)

/* @def PIOC_PPDSR_P3
* @brief Pull Down Status. */
#define PIOC_PPDSR_P3		(1 << 3)

/* @def PIOC_PPDSR_P2
* @brief Pull Down Status. */
#define PIOC_PPDSR_P2		(1 << 2)

/* @def PIOC_PPDSR_P1
* @brief Pull Down Status. */
#define PIOC_PPDSR_P1		(1 << 1)

/* @def PIOC_PPDSR_P0
* @brief Pull Down Status. */
#define PIOC_PPDSR_P0		(1 << 0)

/* --- PIOC_OWER values --------------------------------------------- */


/* @def PIOC_OWER_P31
* @brief Output Write Enable. */
#define PIOC_OWER_P31		(1 << 31)

