grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_OWER_P30
* @brief Output Write Enable. */
#define PIOC_OWER_P30		(1 << 30)

/* @def PIOC_OWER_P29
* @brief Output Write Enable. */
#define PIOC_OWER_P29		(1 << 29)

/* @def PIOC_OWER_P28
* @brief Output Write Enable. */
#define PIOC_OWER_P28		(1 << 28)

/* @def PIOC_OWER_P27
* @brief Output Write Enable. */
#define PIOC_OWER_P27		(1 << 27)

/* @def PIOC_OWER_P26
* @brief Output Write Enable. */
#define PIOC_OWER_P26		(1 << 26)

/* @def PIOC_OWER_P25
* @brief Output Write Enable. */
#define PIOC_OWER_P25		(1 << 25)

/* @def PIOC_OWER_P24
* @brief Output Write Enable. */
#define PIOC_OWER_P24		(1 << 24)

/* @def PIOC_OWER_P23
* @brief Output Write Enable. */
#define PIOC_OWER_P23		(1 << 23)

/* @def PIOC_OWER_P22
* @brief Output Write Enable. */
#define PIOC_OWER_P22		(1 << 22)

/* @def PIOC_OWER_P21
* @brief Output Write Enable. */
#define PIOC_OWER_P21		(1 << 21)

/* @def PIOC_OWER_P20
* @brief Output Write Enable. */
#define PIOC_OWER_P20		(1 << 20)

/* @def PIOC_OWER_P19
* @brief Output Write Enable. */
#define PIOC_OWER_P19		(1 << 19)

/* @def PIOC_OWER_P18
* @brief Output Write Enable. */
#define PIOC_OWER_P18		(1 << 18)

/* @def PIOC_OWER_P17
* @brief Output Write Enable. */
#define PIOC_OWER_P17		(1 << 17)

/* @def PIOC_OWER_P16
* @brief Output Write Enable. */
#define PIOC_OWER_P16		(1 << 16)

/* @def PIOC_OWER_P15
* @brief Output Write Enable. */
#define PIOC_OWER_P15		(1 << 15)

/* @def PIOC_OWER_P14
* @brief Output Write Enable. */
#define PIOC_OWER_P14		(1 << 14)

/* @def PIOC_OWER_P13
* @brief Output Write Enable. */
#define PIOC_OWER_P13		(1 << 13)

/* @def PIOC_OWER_P12
* @brief Output Write Enable. */
#define PIOC_OWER_P12		(1 << 12)

/* @def PIOC_OWER_P11
* @brief Output Write Enable. */
#define PIOC_OWER_P11		(1 << 11)

/* @def PIOC_OWER_P10
* @brief Output Write Enable. */
#define PIOC_OWER_P10		(1 << 10)

/* @def PIOC_OWER_P9
* @brief Output Write Enable. */
#define PIOC_OWER_P9		(1 << 9)

/* @def PIOC_OWER_P8
* @brief Output Write Enable. */
#define PIOC_OWER_P8		(1 << 8)

/* @def PIOC_OWER_P7
* @brief Output Write Enable. */
#define PIOC_OWER_P7		(1 << 7)

/* @def PIOC_OWER_P6
* @brief Output Write Enable. */
#define PIOC_OWER_P6		(1 << 6)

/* @def PIOC_OWER_P5
* @brief Output Write Enable. */
#define PIOC_OWER_P5		(1 << 5)

/* @def PIOC_OWER_P4
* @brief Output Write Enable. */
#define PIOC_OWER_P4		(1 << 4)

/* @def PIOC_OWER_P3
* @brief Output Write Enable. */
#define PIOC_OWER_P3		(1 << 3)

/* @def PIOC_OWER_P2
* @brief Output Write Enable. */
#define PIOC_OWER_P2		(1 << 2)

/* @def PIOC_OWER_P1
* @brief Output Write Enable. */
#define PIOC_OWER_P1		(1 << 1)

/* @def PIOC_OWER_P0
* @brief Output Write Enable. */
#define PIOC_OWER_P0		(1 << 0)

/* --- PIOC_OWDR values --------------------------------------------- */


/* @def PIOC_OWDR_P31
* @brief Output Write Disable. */
#define PIOC_OWDR_P31		(1 << 31)

/* @def PIOC_OWDR_P30
* @brief Output Write Disable. */
#define PIOC_OWDR_P30		(1 << 30)

/* @def PIOC_OWDR_P29
* @brief Output Write Disable. */
#define PIOC_OWDR_P29		(1 << 29)

/* @def PIOC_OWDR_P28
* @brief Output Write Disable. */
#define PIOC_OWDR_P28		(1 << 28)

/* @def PIOC_OWDR_P27
* @brief Output Write Disable. */
#define PIOC_OWDR_P27		(1 << 27)

/* @def PIOC_OWDR_P26
* @brief Output Write Disable. */
#define PIOC_OWDR_P26		(1 << 26)

/* @def PIOC_OWDR_P25
* @brief Output Write Disable. */
#define PIOC_OWDR_P25		(1 << 25)

/* @def PIOC_OWDR_P24
* @brief Output Write Disable. */
#define PIOC_OWDR_P24		(1 << 24)

/* @def PIOC_OWDR_P23
* @brief Output Write Disable. */
#define PIOC_OWDR_P23		(1 << 23)

/* @def PIOC_OWDR_P22
* @brief Output Write Disable. */
#define PIOC_OWDR_P22		(1 << 22)

/* @def PIOC_OWDR_P21
* @brief Output Write Disable. */
#define PIOC_OWDR_P21		(1 << 21)

/* @def PIOC_OWDR_P20
* @brief Output Write Disable. */
#define PIOC_OWDR_P20		(1 << 20)

/* @def PIOC_OWDR_P19
* @brief Output Write Disable. */
#define PIOC_OWDR_P19		(1 << 19)

/* @def PIOC_OWDR_P18
* @brief Output Write Disable. */
#define PIOC_OWDR_P18		(1 << 18)

/* @def PIOC_OWDR_P17
* @brief Output Write Disable. */
#define PIOC_OWDR_P17		(1 << 17)

/* @def PIOC_OWDR_P16
* @brief Output Write Disable. */
#define PIOC_OWDR_P16		(1 << 16)

/* @def PIOC_OWDR_P15
* @brief Output Write Disable. */
#define PIOC_OWDR_P15		(1 << 15)

/* @def PIOC_OWDR_P14
* @brief Output Write Disable. */
#define PIOC_OWDR_P14		(1 << 14)

/* @def PIOC_OWDR_P13
* @brief Output Write Disable. */
#define PIOC_OWDR_P13		(1 << 13)

/* @def PIOC_OWDR_P12
* @brief Output Write Disable. */
#define PIOC_OWDR_P12		(1 << 12)

/* @def PIOC_OWDR_P11
* @brief Output Write Disable. */
#define PIOC_OWDR_P11		(1 << 11)

/* @def PIOC_OWDR_P10
* @brief Output Write Disable. */
#define PIOC_OWDR_P10		(1 << 10)

/* @def PIOC_OWDR_P9
* @brief Output Write Disable. */
#define PIOC_OWDR_P9		(1 << 9)

/* @def PIOC_OWDR_P8
* @brief Output Write Disable. */
#define PIOC_OWDR_P8		(1 << 8)

/* @def PIOC_OWDR_P7
* @brief Output Write Disable. */
#define PIOC_OWDR_P7		(1 << 7)

/* @def PIOC_OWDR_P6
* @brief Output Write Disable. */
#define PIOC_OWDR_P6		(1 << 6)

/* @def PIOC_OWDR_P5
* @brief Output Write Disable. */
#define PIOC_OWDR_P5		(1 << 5)

/* @def PIOC_OWDR_P4
* @brief Output Write Disable. */
#define PIOC_OWDR_P4		(1 << 4)

/* @def PIOC_OWDR_P3
* @brief Output Write Disable. */
#define PIOC_OWDR_P3		(1 << 3)

/* @def PIOC_OWDR_P2
* @brief Output Write Disable. */
#define PIOC_OWDR_P2		(1 << 2)

/* @def PIOC_OWDR_P1
* @brief Output Write Disable. */
#define PIOC_OWDR_P1		(1 << 1)

/* @def PIOC_OWDR_P0
* @brief Output Write Disable. */
#define PIOC_OWDR_P0		(1 << 0)

/* --- PIOC_OWSR values --------------------------------------------- */


/* @def PIOC_OWSR_P31
* @brief Output Write Status. */
#define PIOC_OWSR_P31		(1 << 31)

/* @def PIOC_OWSR_P30
* @brief Output Write Status. */
#define PIOC_OWSR_P30		(1 << 30)

/* @def PIOC_OWSR_P29
* @brief Output Write Status. */
#define PIOC_OWSR_P29		(1 << 29)

/* @def PIOC_OWSR_P28
* @brief Output Write Status. */
#define PIOC_OWSR_P28		(1 << 28)

