grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_OWSR_P27
* @brief Output Write Status. */
#define PIOC_OWSR_P27		(1 << 27)

/* @def PIOC_OWSR_P26
* @brief Output Write Status. */
#define PIOC_OWSR_P26		(1 << 26)

/* @def PIOC_OWSR_P25
* @brief Output Write Status. */
#define PIOC_OWSR_P25		(1 << 25)

/* @def PIOC_OWSR_P24
* @brief Output Write Status. */
#define PIOC_OWSR_P24		(1 << 24)

/* @def PIOC_OWSR_P23
* @brief Output Write Status. */
#define PIOC_OWSR_P23		(1 << 23)

/* @def PIOC_OWSR_P22
* @brief Output Write Status. */
#define PIOC_OWSR_P22		(1 << 22)

/* @def PIOC_OWSR_P21
* @brief Output Write Status. */
#define PIOC_OWSR_P21		(1 << 21)

/* @def PIOC_OWSR_P20
* @brief Output Write Status. */
#define PIOC_OWSR_P20		(1 << 20)

/* @def PIOC_OWSR_P19
* @brief Output Write Status. */
#define PIOC_OWSR_P19		(1 << 19)

/* @def PIOC_OWSR_P18
* @brief Output Write Status. */
#define PIOC_OWSR_P18		(1 << 18)

/* @def PIOC_OWSR_P17
* @brief Output Write Status. */
#define PIOC_OWSR_P17		(1 << 17)

/* @def PIOC_OWSR_P16
* @brief Output Write Status. */
#define PIOC_OWSR_P16		(1 << 16)

/* @def PIOC_OWSR_P15
* @brief Output Write Status. */
#define PIOC_OWSR_P15		(1 << 15)

/* @def PIOC_OWSR_P14
* @brief Output Write Status. */
#define PIOC_OWSR_P14		(1 << 14)

/* @def PIOC_OWSR_P13
* @brief Output Write Status. */
#define PIOC_OWSR_P13		(1 << 13)

/* @def PIOC_OWSR_P12
* @brief Output Write Status. */
#define PIOC_OWSR_P12		(1 << 12)

/* @def PIOC_OWSR_P11
* @brief Output Write Status. */
#define PIOC_OWSR_P11		(1 << 11)

/* @def PIOC_OWSR_P10
* @brief Output Write Status. */
#define PIOC_OWSR_P10		(1 << 10)

/* @def PIOC_OWSR_P9
* @brief Output Write Status. */
#define PIOC_OWSR_P9		(1 << 9)

/* @def PIOC_OWSR_P8
* @brief Output Write Status. */
#define PIOC_OWSR_P8		(1 << 8)

/* @def PIOC_OWSR_P7
* @brief Output Write Status. */
#define PIOC_OWSR_P7		(1 << 7)

/* @def PIOC_OWSR_P6
* @brief Output Write Status. */
#define PIOC_OWSR_P6		(1 << 6)

/* @def PIOC_OWSR_P5
* @brief Output Write Status. */
#define PIOC_OWSR_P5		(1 << 5)

/* @def PIOC_OWSR_P4
* @brief Output Write Status. */
#define PIOC_OWSR_P4		(1 << 4)

/* @def PIOC_OWSR_P3
* @brief Output Write Status. */
#define PIOC_OWSR_P3		(1 << 3)

/* @def PIOC_OWSR_P2
* @brief Output Write Status. */
#define PIOC_OWSR_P2		(1 << 2)

/* @def PIOC_OWSR_P1
* @brief Output Write Status. */
#define PIOC_OWSR_P1		(1 << 1)

/* @def PIOC_OWSR_P0
* @brief Output Write Status. */
#define PIOC_OWSR_P0		(1 << 0)

/* --- PIOC_AIMER values -------------------------------------------- */


/* @def PIOC_AIMER_P31
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P31		(1 << 31)

/* @def PIOC_AIMER_P30
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P30		(1 << 30)

/* @def PIOC_AIMER_P29
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P29		(1 << 29)

/* @def PIOC_AIMER_P28
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P28		(1 << 28)

/* @def PIOC_AIMER_P27
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P27		(1 << 27)

/* @def PIOC_AIMER_P26
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P26		(1 << 26)

/* @def PIOC_AIMER_P25
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P25		(1 << 25)

/* @def PIOC_AIMER_P24
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P24		(1 << 24)

/* @def PIOC_AIMER_P23
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P23		(1 << 23)

/* @def PIOC_AIMER_P22
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P22		(1 << 22)

/* @def PIOC_AIMER_P21
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P21		(1 << 21)

/* @def PIOC_AIMER_P20
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P20		(1 << 20)

/* @def PIOC_AIMER_P19
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P19		(1 << 19)

/* @def PIOC_AIMER_P18
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P18		(1 << 18)

/* @def PIOC_AIMER_P17
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P17		(1 << 17)

/* @def PIOC_AIMER_P16
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P16		(1 << 16)

/* @def PIOC_AIMER_P15
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P15		(1 << 15)

/* @def PIOC_AIMER_P14
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P14		(1 << 14)

/* @def PIOC_AIMER_P13
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P13		(1 << 13)

/* @def PIOC_AIMER_P12
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P12		(1 << 12)

/* @def PIOC_AIMER_P11
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P11		(1 << 11)

/* @def PIOC_AIMER_P10
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P10		(1 << 10)

/* @def PIOC_AIMER_P9
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P9		(1 << 9)

/* @def PIOC_AIMER_P8
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P8		(1 << 8)

/* @def PIOC_AIMER_P7
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P7		(1 << 7)

/* @def PIOC_AIMER_P6
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P6		(1 << 6)

/* @def PIOC_AIMER_P5
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P5		(1 << 5)

/* @def PIOC_AIMER_P4
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P4		(1 << 4)

/* @def PIOC_AIMER_P3
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P3		(1 << 3)

/* @def PIOC_AIMER_P2
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P2		(1 << 2)

/* @def PIOC_AIMER_P1
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P1		(1 << 1)

/* @def PIOC_AIMER_P0
* @brief Additional Interrupt Modes Enable. */
#define PIOC_AIMER_P0		(1 << 0)

/* --- PIOC_AIMDR values -------------------------------------------- */


/* @def PIOC_AIMDR_P31
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P31		(1 << 31)

