grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_AIMDR_P30
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P30		(1 << 30)

/* @def PIOC_AIMDR_P29
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P29		(1 << 29)

/* @def PIOC_AIMDR_P28
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P28		(1 << 28)

/* @def PIOC_AIMDR_P27
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P27		(1 << 27)

/* @def PIOC_AIMDR_P26
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P26		(1 << 26)

/* @def PIOC_AIMDR_P25
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P25		(1 << 25)

/* @def PIOC_AIMDR_P24
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P24		(1 << 24)

/* @def PIOC_AIMDR_P23
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P23		(1 << 23)

/* @def PIOC_AIMDR_P22
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P22		(1 << 22)

/* @def PIOC_AIMDR_P21
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P21		(1 << 21)

/* @def PIOC_AIMDR_P20
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P20		(1 << 20)

/* @def PIOC_AIMDR_P19
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P19		(1 << 19)

/* @def PIOC_AIMDR_P18
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P18		(1 << 18)

/* @def PIOC_AIMDR_P17
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P17		(1 << 17)

/* @def PIOC_AIMDR_P16
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P16		(1 << 16)

/* @def PIOC_AIMDR_P15
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P15		(1 << 15)

/* @def PIOC_AIMDR_P14
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P14		(1 << 14)

/* @def PIOC_AIMDR_P13
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P13		(1 << 13)

/* @def PIOC_AIMDR_P12
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P12		(1 << 12)

/* @def PIOC_AIMDR_P11
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P11		(1 << 11)

/* @def PIOC_AIMDR_P10
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P10		(1 << 10)

/* @def PIOC_AIMDR_P9
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P9		(1 << 9)

/* @def PIOC_AIMDR_P8
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P8		(1 << 8)

/* @def PIOC_AIMDR_P7
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P7		(1 << 7)

/* @def PIOC_AIMDR_P6
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P6		(1 << 6)

/* @def PIOC_AIMDR_P5
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P5		(1 << 5)

/* @def PIOC_AIMDR_P4
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P4		(1 << 4)

/* @def PIOC_AIMDR_P3
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P3		(1 << 3)

/* @def PIOC_AIMDR_P2
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P2		(1 << 2)

/* @def PIOC_AIMDR_P1
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P1		(1 << 1)

/* @def PIOC_AIMDR_P0
* @brief Additional Interrupt Modes Disable. */
#define PIOC_AIMDR_P0		(1 << 0)

/* --- PIOC_AIMMR values -------------------------------------------- */


/* @def PIOC_AIMMR_P31
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P31		(1 << 31)

/* @def PIOC_AIMMR_P30
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P30		(1 << 30)

/* @def PIOC_AIMMR_P29
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P29		(1 << 29)

/* @def PIOC_AIMMR_P28
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P28		(1 << 28)

/* @def PIOC_AIMMR_P27
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P27		(1 << 27)

/* @def PIOC_AIMMR_P26
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P26		(1 << 26)

/* @def PIOC_AIMMR_P25
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P25		(1 << 25)

/* @def PIOC_AIMMR_P24
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P24		(1 << 24)

/* @def PIOC_AIMMR_P23
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P23		(1 << 23)

/* @def PIOC_AIMMR_P22
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P22		(1 << 22)

/* @def PIOC_AIMMR_P21
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P21		(1 << 21)

/* @def PIOC_AIMMR_P20
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P20		(1 << 20)

/* @def PIOC_AIMMR_P19
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P19		(1 << 19)

/* @def PIOC_AIMMR_P18
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P18		(1 << 18)

/* @def PIOC_AIMMR_P17
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P17		(1 << 17)

/* @def PIOC_AIMMR_P16
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P16		(1 << 16)

/* @def PIOC_AIMMR_P15
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P15		(1 << 15)

/* @def PIOC_AIMMR_P14
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P14		(1 << 14)

/* @def PIOC_AIMMR_P13
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P13		(1 << 13)

/* @def PIOC_AIMMR_P12
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P12		(1 << 12)

/* @def PIOC_AIMMR_P11
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P11		(1 << 11)

/* @def PIOC_AIMMR_P10
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P10		(1 << 10)

/* @def PIOC_AIMMR_P9
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P9		(1 << 9)

/* @def PIOC_AIMMR_P8
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P8		(1 << 8)

/* @def PIOC_AIMMR_P7
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P7		(1 << 7)

/* @def PIOC_AIMMR_P6
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P6		(1 << 6)

/* @def PIOC_AIMMR_P5
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P5		(1 << 5)

/* @def PIOC_AIMMR_P4
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P4		(1 << 4)

/* @def PIOC_AIMMR_P3
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P3		(1 << 3)

/* @def PIOC_AIMMR_P2
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P2		(1 << 2)

/* @def PIOC_AIMMR_P1
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P1		(1 << 1)

/* @def PIOC_AIMMR_P0
* @brief Peripheral CD Status. */
#define PIOC_AIMMR_P0		(1 << 0)

/* --- PIOC_ESR values ---------------------------------------------- */


