grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_ESR_P31
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P31		(1 << 31)

/* @def PIOC_ESR_P30
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P30		(1 << 30)

/* @def PIOC_ESR_P29
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P29		(1 << 29)

/* @def PIOC_ESR_P28
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P28		(1 << 28)

/* @def PIOC_ESR_P27
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P27		(1 << 27)

/* @def PIOC_ESR_P26
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P26		(1 << 26)

/* @def PIOC_ESR_P25
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P25		(1 << 25)

/* @def PIOC_ESR_P24
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P24		(1 << 24)

/* @def PIOC_ESR_P23
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P23		(1 << 23)

/* @def PIOC_ESR_P22
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P22		(1 << 22)

/* @def PIOC_ESR_P21
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P21		(1 << 21)

/* @def PIOC_ESR_P20
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P20		(1 << 20)

/* @def PIOC_ESR_P19
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P19		(1 << 19)

/* @def PIOC_ESR_P18
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P18		(1 << 18)

/* @def PIOC_ESR_P17
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P17		(1 << 17)

/* @def PIOC_ESR_P16
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P16		(1 << 16)

/* @def PIOC_ESR_P15
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P15		(1 << 15)

/* @def PIOC_ESR_P14
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P14		(1 << 14)

/* @def PIOC_ESR_P13
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P13		(1 << 13)

/* @def PIOC_ESR_P12
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P12		(1 << 12)

/* @def PIOC_ESR_P11
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P11		(1 << 11)

/* @def PIOC_ESR_P10
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P10		(1 << 10)

/* @def PIOC_ESR_P9
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P9		(1 << 9)

/* @def PIOC_ESR_P8
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P8		(1 << 8)

/* @def PIOC_ESR_P7
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P7		(1 << 7)

/* @def PIOC_ESR_P6
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P6		(1 << 6)

/* @def PIOC_ESR_P5
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P5		(1 << 5)

/* @def PIOC_ESR_P4
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P4		(1 << 4)

/* @def PIOC_ESR_P3
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P3		(1 << 3)

/* @def PIOC_ESR_P2
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P2		(1 << 2)

/* @def PIOC_ESR_P1
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P1		(1 << 1)

/* @def PIOC_ESR_P0
* @brief Edge Interrupt Selection. */
#define PIOC_ESR_P0		(1 << 0)

/* --- PIOC_LSR values ---------------------------------------------- */


/* @def PIOC_LSR_P31
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P31		(1 << 31)

/* @def PIOC_LSR_P30
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P30		(1 << 30)

/* @def PIOC_LSR_P29
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P29		(1 << 29)

/* @def PIOC_LSR_P28
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P28		(1 << 28)

/* @def PIOC_LSR_P27
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P27		(1 << 27)

/* @def PIOC_LSR_P26
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P26		(1 << 26)

/* @def PIOC_LSR_P25
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P25		(1 << 25)

/* @def PIOC_LSR_P24
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P24		(1 << 24)

/* @def PIOC_LSR_P23
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P23		(1 << 23)

/* @def PIOC_LSR_P22
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P22		(1 << 22)

/* @def PIOC_LSR_P21
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P21		(1 << 21)

/* @def PIOC_LSR_P20
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P20		(1 << 20)

/* @def PIOC_LSR_P19
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P19		(1 << 19)

/* @def PIOC_LSR_P18
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P18		(1 << 18)

/* @def PIOC_LSR_P17
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P17		(1 << 17)

/* @def PIOC_LSR_P16
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P16		(1 << 16)

/* @def PIOC_LSR_P15
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P15		(1 << 15)

/* @def PIOC_LSR_P14
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P14		(1 << 14)

/* @def PIOC_LSR_P13
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P13		(1 << 13)

/* @def PIOC_LSR_P12
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P12		(1 << 12)

/* @def PIOC_LSR_P11
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P11		(1 << 11)

/* @def PIOC_LSR_P10
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P10		(1 << 10)

/* @def PIOC_LSR_P9
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P9		(1 << 9)

/* @def PIOC_LSR_P8
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P8		(1 << 8)

/* @def PIOC_LSR_P7
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P7		(1 << 7)

/* @def PIOC_LSR_P6
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P6		(1 << 6)

/* @def PIOC_LSR_P5
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P5		(1 << 5)

/* @def PIOC_LSR_P4
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P4		(1 << 4)

/* @def PIOC_LSR_P3
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P3		(1 << 3)

/* @def PIOC_LSR_P2
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P2		(1 << 2)

/* @def PIOC_LSR_P1
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P1		(1 << 1)

/* @def PIOC_LSR_P0
* @brief Level Interrupt Selection. */
#define PIOC_LSR_P0		(1 << 0)

/* --- PIOC_ELSR values --------------------------------------------- */


