grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_ELSR_P31
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P31		(1 << 31)

/* @def PIOC_ELSR_P30
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P30		(1 << 30)

/* @def PIOC_ELSR_P29
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P29		(1 << 29)

/* @def PIOC_ELSR_P28
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P28		(1 << 28)

/* @def PIOC_ELSR_P27
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P27		(1 << 27)

/* @def PIOC_ELSR_P26
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P26		(1 << 26)

/* @def PIOC_ELSR_P25
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P25		(1 << 25)

/* @def PIOC_ELSR_P24
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P24		(1 << 24)

/* @def PIOC_ELSR_P23
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P23		(1 << 23)

/* @def PIOC_ELSR_P22
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P22		(1 << 22)

/* @def PIOC_ELSR_P21
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P21		(1 << 21)

/* @def PIOC_ELSR_P20
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P20		(1 << 20)

/* @def PIOC_ELSR_P19
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P19		(1 << 19)

/* @def PIOC_ELSR_P18
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P18		(1 << 18)

/* @def PIOC_ELSR_P17
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P17		(1 << 17)

/* @def PIOC_ELSR_P16
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P16		(1 << 16)

/* @def PIOC_ELSR_P15
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P15		(1 << 15)

/* @def PIOC_ELSR_P14
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P14		(1 << 14)

/* @def PIOC_ELSR_P13
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P13		(1 << 13)

/* @def PIOC_ELSR_P12
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P12		(1 << 12)

/* @def PIOC_ELSR_P11
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P11		(1 << 11)

/* @def PIOC_ELSR_P10
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P10		(1 << 10)

/* @def PIOC_ELSR_P9
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P9		(1 << 9)

/* @def PIOC_ELSR_P8
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P8		(1 << 8)

/* @def PIOC_ELSR_P7
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P7		(1 << 7)

/* @def PIOC_ELSR_P6
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P6		(1 << 6)

/* @def PIOC_ELSR_P5
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P5		(1 << 5)

/* @def PIOC_ELSR_P4
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P4		(1 << 4)

/* @def PIOC_ELSR_P3
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P3		(1 << 3)

/* @def PIOC_ELSR_P2
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P2		(1 << 2)

/* @def PIOC_ELSR_P1
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P1		(1 << 1)

/* @def PIOC_ELSR_P0
* @brief Edge/Level Interrupt source selection. */
#define PIOC_ELSR_P0		(1 << 0)

/* --- PIOC_FELLSR values ------------------------------------------- */


/* @def PIOC_FELLSR_P31
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P31		(1 << 31)

/* @def PIOC_FELLSR_P30
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P30		(1 << 30)

/* @def PIOC_FELLSR_P29
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P29		(1 << 29)

/* @def PIOC_FELLSR_P28
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P28		(1 << 28)

/* @def PIOC_FELLSR_P27
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P27		(1 << 27)

/* @def PIOC_FELLSR_P26
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P26		(1 << 26)

/* @def PIOC_FELLSR_P25
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P25		(1 << 25)

/* @def PIOC_FELLSR_P24
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P24		(1 << 24)

/* @def PIOC_FELLSR_P23
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P23		(1 << 23)

/* @def PIOC_FELLSR_P22
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P22		(1 << 22)

/* @def PIOC_FELLSR_P21
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P21		(1 << 21)

/* @def PIOC_FELLSR_P20
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P20		(1 << 20)

/* @def PIOC_FELLSR_P19
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P19		(1 << 19)

/* @def PIOC_FELLSR_P18
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P18		(1 << 18)

/* @def PIOC_FELLSR_P17
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P17		(1 << 17)

/* @def PIOC_FELLSR_P16
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P16		(1 << 16)

/* @def PIOC_FELLSR_P15
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P15		(1 << 15)

/* @def PIOC_FELLSR_P14
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P14		(1 << 14)

/* @def PIOC_FELLSR_P13
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P13		(1 << 13)

/* @def PIOC_FELLSR_P12
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P12		(1 << 12)

/* @def PIOC_FELLSR_P11
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P11		(1 << 11)

/* @def PIOC_FELLSR_P10
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P10		(1 << 10)

/* @def PIOC_FELLSR_P9
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P9		(1 << 9)

/* @def PIOC_FELLSR_P8
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P8		(1 << 8)

