grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_FELLSR_P7
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P7		(1 << 7)

/* @def PIOC_FELLSR_P6
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P6		(1 << 6)

/* @def PIOC_FELLSR_P5
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P5		(1 << 5)

/* @def PIOC_FELLSR_P4
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P4		(1 << 4)

/* @def PIOC_FELLSR_P3
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P3		(1 << 3)

/* @def PIOC_FELLSR_P2
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P2		(1 << 2)

/* @def PIOC_FELLSR_P1
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P1		(1 << 1)

/* @def PIOC_FELLSR_P0
* @brief Falling Edge/Low Level Interrupt Selection. */
#define PIOC_FELLSR_P0		(1 << 0)

/* --- PIOC_REHLSR values ------------------------------------------- */


/* @def PIOC_REHLSR_P31
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P31		(1 << 31)

/* @def PIOC_REHLSR_P30
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P30		(1 << 30)

/* @def PIOC_REHLSR_P29
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P29		(1 << 29)

/* @def PIOC_REHLSR_P28
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P28		(1 << 28)

/* @def PIOC_REHLSR_P27
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P27		(1 << 27)

/* @def PIOC_REHLSR_P26
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P26		(1 << 26)

/* @def PIOC_REHLSR_P25
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P25		(1 << 25)

/* @def PIOC_REHLSR_P24
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P24		(1 << 24)

/* @def PIOC_REHLSR_P23
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P23		(1 << 23)

/* @def PIOC_REHLSR_P22
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P22		(1 << 22)

/* @def PIOC_REHLSR_P21
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P21		(1 << 21)

/* @def PIOC_REHLSR_P20
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P20		(1 << 20)

/* @def PIOC_REHLSR_P19
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P19		(1 << 19)

/* @def PIOC_REHLSR_P18
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P18		(1 << 18)

/* @def PIOC_REHLSR_P17
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P17		(1 << 17)

/* @def PIOC_REHLSR_P16
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P16		(1 << 16)

/* @def PIOC_REHLSR_P15
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P15		(1 << 15)

/* @def PIOC_REHLSR_P14
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P14		(1 << 14)

/* @def PIOC_REHLSR_P13
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P13		(1 << 13)

/* @def PIOC_REHLSR_P12
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P12		(1 << 12)

/* @def PIOC_REHLSR_P11
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P11		(1 << 11)

/* @def PIOC_REHLSR_P10
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P10		(1 << 10)

/* @def PIOC_REHLSR_P9
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P9		(1 << 9)

/* @def PIOC_REHLSR_P8
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P8		(1 << 8)

/* @def PIOC_REHLSR_P7
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P7		(1 << 7)

/* @def PIOC_REHLSR_P6
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P6		(1 << 6)

/* @def PIOC_REHLSR_P5
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P5		(1 << 5)

/* @def PIOC_REHLSR_P4
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P4		(1 << 4)

/* @def PIOC_REHLSR_P3
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P3		(1 << 3)

/* @def PIOC_REHLSR_P2
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P2		(1 << 2)

/* @def PIOC_REHLSR_P1
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P1		(1 << 1)

/* @def PIOC_REHLSR_P0
* @brief Rising Edge /High Level Interrupt Selection. */
#define PIOC_REHLSR_P0		(1 << 0)

/* --- PIOC_FRLHSR values ------------------------------------------- */


/* @def PIOC_FRLHSR_P31
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P31		(1 << 31)

/* @def PIOC_FRLHSR_P30
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P30		(1 << 30)

/* @def PIOC_FRLHSR_P29
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P29		(1 << 29)

/* @def PIOC_FRLHSR_P28
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P28		(1 << 28)

/* @def PIOC_FRLHSR_P27
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P27		(1 << 27)

/* @def PIOC_FRLHSR_P26
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P26		(1 << 26)

/* @def PIOC_FRLHSR_P25
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P25		(1 << 25)

/* @def PIOC_FRLHSR_P24
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P24		(1 << 24)

/* @def PIOC_FRLHSR_P23
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P23		(1 << 23)

/* @def PIOC_FRLHSR_P22
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P22		(1 << 22)

/* @def PIOC_FRLHSR_P21
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P21		(1 << 21)

