grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_FRLHSR_P20
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P20		(1 << 20)

/* @def PIOC_FRLHSR_P19
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P19		(1 << 19)

/* @def PIOC_FRLHSR_P18
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P18		(1 << 18)

/* @def PIOC_FRLHSR_P17
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P17		(1 << 17)

/* @def PIOC_FRLHSR_P16
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P16		(1 << 16)

/* @def PIOC_FRLHSR_P15
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P15		(1 << 15)

/* @def PIOC_FRLHSR_P14
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P14		(1 << 14)

/* @def PIOC_FRLHSR_P13
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P13		(1 << 13)

/* @def PIOC_FRLHSR_P12
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P12		(1 << 12)

/* @def PIOC_FRLHSR_P11
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P11		(1 << 11)

/* @def PIOC_FRLHSR_P10
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P10		(1 << 10)

/* @def PIOC_FRLHSR_P9
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P9		(1 << 9)

/* @def PIOC_FRLHSR_P8
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P8		(1 << 8)

/* @def PIOC_FRLHSR_P7
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P7		(1 << 7)

/* @def PIOC_FRLHSR_P6
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P6		(1 << 6)

/* @def PIOC_FRLHSR_P5
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P5		(1 << 5)

/* @def PIOC_FRLHSR_P4
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P4		(1 << 4)

/* @def PIOC_FRLHSR_P3
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P3		(1 << 3)

/* @def PIOC_FRLHSR_P2
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P2		(1 << 2)

/* @def PIOC_FRLHSR_P1
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P1		(1 << 1)

/* @def PIOC_FRLHSR_P0
* @brief Edge /Level Interrupt Source Selection. */
#define PIOC_FRLHSR_P0		(1 << 0)

/* --- PIOC_LOCKSR values ------------------------------------------- */


/* @def PIOC_LOCKSR_P31
* @brief Lock Status. */
#define PIOC_LOCKSR_P31		(1 << 31)

/* @def PIOC_LOCKSR_P30
* @brief Lock Status. */
#define PIOC_LOCKSR_P30		(1 << 30)

/* @def PIOC_LOCKSR_P29
* @brief Lock Status. */
#define PIOC_LOCKSR_P29		(1 << 29)

/* @def PIOC_LOCKSR_P28
* @brief Lock Status. */
#define PIOC_LOCKSR_P28		(1 << 28)

/* @def PIOC_LOCKSR_P27
* @brief Lock Status. */
#define PIOC_LOCKSR_P27		(1 << 27)

/* @def PIOC_LOCKSR_P26
* @brief Lock Status. */
#define PIOC_LOCKSR_P26		(1 << 26)

/* @def PIOC_LOCKSR_P25
* @brief Lock Status. */
#define PIOC_LOCKSR_P25		(1 << 25)

/* @def PIOC_LOCKSR_P24
* @brief Lock Status. */
#define PIOC_LOCKSR_P24		(1 << 24)

/* @def PIOC_LOCKSR_P23
* @brief Lock Status. */
#define PIOC_LOCKSR_P23		(1 << 23)

/* @def PIOC_LOCKSR_P22
* @brief Lock Status. */
#define PIOC_LOCKSR_P22		(1 << 22)

/* @def PIOC_LOCKSR_P21
* @brief Lock Status. */
#define PIOC_LOCKSR_P21		(1 << 21)

/* @def PIOC_LOCKSR_P20
* @brief Lock Status. */
#define PIOC_LOCKSR_P20		(1 << 20)

/* @def PIOC_LOCKSR_P19
* @brief Lock Status. */
#define PIOC_LOCKSR_P19		(1 << 19)

/* @def PIOC_LOCKSR_P18
* @brief Lock Status. */
#define PIOC_LOCKSR_P18		(1 << 18)

/* @def PIOC_LOCKSR_P17
* @brief Lock Status. */
#define PIOC_LOCKSR_P17		(1 << 17)

/* @def PIOC_LOCKSR_P16
* @brief Lock Status. */
#define PIOC_LOCKSR_P16		(1 << 16)

/* @def PIOC_LOCKSR_P15
* @brief Lock Status. */
#define PIOC_LOCKSR_P15		(1 << 15)

/* @def PIOC_LOCKSR_P14
* @brief Lock Status. */
#define PIOC_LOCKSR_P14		(1 << 14)

/* @def PIOC_LOCKSR_P13
* @brief Lock Status. */
#define PIOC_LOCKSR_P13		(1 << 13)

/* @def PIOC_LOCKSR_P12
* @brief Lock Status. */
#define PIOC_LOCKSR_P12		(1 << 12)

/* @def PIOC_LOCKSR_P11
* @brief Lock Status. */
#define PIOC_LOCKSR_P11		(1 << 11)

/* @def PIOC_LOCKSR_P10
* @brief Lock Status. */
#define PIOC_LOCKSR_P10		(1 << 10)

/* @def PIOC_LOCKSR_P9
* @brief Lock Status. */
#define PIOC_LOCKSR_P9		(1 << 9)

/* @def PIOC_LOCKSR_P8
* @brief Lock Status. */
#define PIOC_LOCKSR_P8		(1 << 8)

/* @def PIOC_LOCKSR_P7
* @brief Lock Status. */
#define PIOC_LOCKSR_P7		(1 << 7)

/* @def PIOC_LOCKSR_P6
* @brief Lock Status. */
#define PIOC_LOCKSR_P6		(1 << 6)

/* @def PIOC_LOCKSR_P5
* @brief Lock Status. */
#define PIOC_LOCKSR_P5		(1 << 5)

/* @def PIOC_LOCKSR_P4
* @brief Lock Status. */
#define PIOC_LOCKSR_P4		(1 << 4)

/* @def PIOC_LOCKSR_P3
* @brief Lock Status. */
#define PIOC_LOCKSR_P3		(1 << 3)

/* @def PIOC_LOCKSR_P2
* @brief Lock Status. */
#define PIOC_LOCKSR_P2		(1 << 2)

/* @def PIOC_LOCKSR_P1
* @brief Lock Status. */
#define PIOC_LOCKSR_P1		(1 << 1)

/* @def PIOC_LOCKSR_P0
* @brief Lock Status. */
#define PIOC_LOCKSR_P0		(1 << 0)

/* --- PIOC_WPMR values --------------------------------------------- */


/* @def PIOC_WPMR_WPKEY
* @brief Write Protect KEY */
#define PIOC_WPMR_WPKEY_SHIFT		8
#define PIOC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup pioc_wpmr_wpkey WPKEY
* @brief Write Protect KEY
@{*/
/*@}*/

/* @def PIOC_WPMR_WPEN
* @brief Write Protect Enable */
#define PIOC_WPMR_WPEN		(1 << 0)

/* --- PIOC_WPSR values --------------------------------------------- */


/* @def PIOC_WPSR_WPVSRC
* @brief Write Protect Violation Source */
#define PIOC_WPSR_WPVSRC_SHIFT		8
#define PIOC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pioc_wpsr_wpvsrc WPVSRC
* @brief Write Protect Violation Source
@{*/
/*@}*/

/* @def PIOC_WPSR_WPVS
* @brief Write Protect Violation Status */
#define PIOC_WPSR_WPVS		(1 << 0)

/* --- PIOC_SCHMITT values ------------------------------------------ */


/* @def PIOC_SCHMITT_SCHMITT31
* @brief  */
#define PIOC_SCHMITT_SCHMITT31		(1 << 31)

