grevaillot/svd_tools/headers/ATSAM4S8B/pioc.h
/* @def PIOC_SCHMITT_SCHMITT30
* @brief  */
#define PIOC_SCHMITT_SCHMITT30		(1 << 30)

/* @def PIOC_SCHMITT_SCHMITT29
* @brief  */
#define PIOC_SCHMITT_SCHMITT29		(1 << 29)

/* @def PIOC_SCHMITT_SCHMITT28
* @brief  */
#define PIOC_SCHMITT_SCHMITT28		(1 << 28)

/* @def PIOC_SCHMITT_SCHMITT27
* @brief  */
#define PIOC_SCHMITT_SCHMITT27		(1 << 27)

/* @def PIOC_SCHMITT_SCHMITT26
* @brief  */
#define PIOC_SCHMITT_SCHMITT26		(1 << 26)

/* @def PIOC_SCHMITT_SCHMITT25
* @brief  */
#define PIOC_SCHMITT_SCHMITT25		(1 << 25)

/* @def PIOC_SCHMITT_SCHMITT24
* @brief  */
#define PIOC_SCHMITT_SCHMITT24		(1 << 24)

/* @def PIOC_SCHMITT_SCHMITT23
* @brief  */
#define PIOC_SCHMITT_SCHMITT23		(1 << 23)

/* @def PIOC_SCHMITT_SCHMITT22
* @brief  */
#define PIOC_SCHMITT_SCHMITT22		(1 << 22)

/* @def PIOC_SCHMITT_SCHMITT21
* @brief  */
#define PIOC_SCHMITT_SCHMITT21		(1 << 21)

/* @def PIOC_SCHMITT_SCHMITT20
* @brief  */
#define PIOC_SCHMITT_SCHMITT20		(1 << 20)

/* @def PIOC_SCHMITT_SCHMITT19
* @brief  */
#define PIOC_SCHMITT_SCHMITT19		(1 << 19)

/* @def PIOC_SCHMITT_SCHMITT18
* @brief  */
#define PIOC_SCHMITT_SCHMITT18		(1 << 18)

/* @def PIOC_SCHMITT_SCHMITT17
* @brief  */
#define PIOC_SCHMITT_SCHMITT17		(1 << 17)

/* @def PIOC_SCHMITT_SCHMITT16
* @brief  */
#define PIOC_SCHMITT_SCHMITT16		(1 << 16)

/* @def PIOC_SCHMITT_SCHMITT15
* @brief  */
#define PIOC_SCHMITT_SCHMITT15		(1 << 15)

/* @def PIOC_SCHMITT_SCHMITT14
* @brief  */
#define PIOC_SCHMITT_SCHMITT14		(1 << 14)

/* @def PIOC_SCHMITT_SCHMITT13
* @brief  */
#define PIOC_SCHMITT_SCHMITT13		(1 << 13)

/* @def PIOC_SCHMITT_SCHMITT12
* @brief  */
#define PIOC_SCHMITT_SCHMITT12		(1 << 12)

/* @def PIOC_SCHMITT_SCHMITT11
* @brief  */
#define PIOC_SCHMITT_SCHMITT11		(1 << 11)

/* @def PIOC_SCHMITT_SCHMITT10
* @brief  */
#define PIOC_SCHMITT_SCHMITT10		(1 << 10)

/* @def PIOC_SCHMITT_SCHMITT9
* @brief  */
#define PIOC_SCHMITT_SCHMITT9		(1 << 9)

/* @def PIOC_SCHMITT_SCHMITT8
* @brief  */
#define PIOC_SCHMITT_SCHMITT8		(1 << 8)

/* @def PIOC_SCHMITT_SCHMITT7
* @brief  */
#define PIOC_SCHMITT_SCHMITT7		(1 << 7)

/* @def PIOC_SCHMITT_SCHMITT6
* @brief  */
#define PIOC_SCHMITT_SCHMITT6		(1 << 6)

/* @def PIOC_SCHMITT_SCHMITT5
* @brief  */
#define PIOC_SCHMITT_SCHMITT5		(1 << 5)

/* @def PIOC_SCHMITT_SCHMITT4
* @brief  */
#define PIOC_SCHMITT_SCHMITT4		(1 << 4)

/* @def PIOC_SCHMITT_SCHMITT3
* @brief  */
#define PIOC_SCHMITT_SCHMITT3		(1 << 3)

/* @def PIOC_SCHMITT_SCHMITT2
* @brief  */
#define PIOC_SCHMITT_SCHMITT2		(1 << 2)

/* @def PIOC_SCHMITT_SCHMITT1
* @brief  */
#define PIOC_SCHMITT_SCHMITT1		(1 << 1)

/* @def PIOC_SCHMITT_SCHMITT0
* @brief  */
#define PIOC_SCHMITT_SCHMITT0		(1 << 0)

/* --- PIOC_PCMR values --------------------------------------------- */


/* @def PIOC_PCMR_FRSTS
* @brief Parallel Capture Mode First Sample */
#define PIOC_PCMR_FRSTS		(1 << 11)

/* @def PIOC_PCMR_HALFS
* @brief Parallel Capture Mode Half Sampling */
#define PIOC_PCMR_HALFS		(1 << 10)

/* @def PIOC_PCMR_ALWYS
* @brief Parallel Capture Mode Always Sampling */
#define PIOC_PCMR_ALWYS		(1 << 9)

/* @def PIOC_PCMR_DSIZE
* @brief Parallel Capture Mode Data Size */
#define PIOC_PCMR_DSIZE_SHIFT		4
#define PIOC_PCMR_DSIZE_MASK		0x03
/** @defgroup pioc_pcmr_dsize DSIZE
* @brief Parallel Capture Mode Data Size
@{*/
/*@}*/

/* @def PIOC_PCMR_PCEN
* @brief Parallel Capture Mode Enable */
#define PIOC_PCMR_PCEN		(1 << 0)

/* --- PIOC_PCIER values -------------------------------------------- */


/* @def PIOC_PCIER_RXBUFF
* @brief Reception Buffer Full Interrupt Enable */
#define PIOC_PCIER_RXBUFF		(1 << 3)

/* @def PIOC_PCIER_ENDRX
* @brief End of Reception Transfer Interrupt Enable */
#define PIOC_PCIER_ENDRX		(1 << 2)

/* @def PIOC_PCIER_OVRE
* @brief Parallel Capture Mode Overrun Error Interrupt Enable */
#define PIOC_PCIER_OVRE		(1 << 1)

/* @def PIOC_PCIER_DRDY
* @brief Parallel Capture Mode Data Ready Interrupt Enable */
#define PIOC_PCIER_DRDY		(1 << 0)

/* --- PIOC_PCIDR values -------------------------------------------- */


/* @def PIOC_PCIDR_RXBUFF
* @brief Reception Buffer Full Interrupt Disable */
#define PIOC_PCIDR_RXBUFF		(1 << 3)

/* @def PIOC_PCIDR_ENDRX
* @brief End of Reception Transfer Interrupt Disable */
#define PIOC_PCIDR_ENDRX		(1 << 2)

/* @def PIOC_PCIDR_OVRE
* @brief Parallel Capture Mode Overrun Error Interrupt Disable */
#define PIOC_PCIDR_OVRE		(1 << 1)

/* @def PIOC_PCIDR_DRDY
* @brief Parallel Capture Mode Data Ready Interrupt Disable */
#define PIOC_PCIDR_DRDY		(1 << 0)

/* --- PIOC_PCIMR values -------------------------------------------- */


/* @def PIOC_PCIMR_RXBUFF
* @brief Reception Buffer Full Interrupt Mask */
#define PIOC_PCIMR_RXBUFF		(1 << 3)

/* @def PIOC_PCIMR_ENDRX
* @brief End of Reception Transfer Interrupt Mask */
#define PIOC_PCIMR_ENDRX		(1 << 2)

/* @def PIOC_PCIMR_OVRE
* @brief Parallel Capture Mode Overrun Error Interrupt Mask */
#define PIOC_PCIMR_OVRE		(1 << 1)

/* @def PIOC_PCIMR_DRDY
* @brief Parallel Capture Mode Data Ready Interrupt Mask */
#define PIOC_PCIMR_DRDY		(1 << 0)

/* --- PIOC_PCISR values -------------------------------------------- */


/* @def PIOC_PCISR_RXBUFF
* @brief Reception Buffer Full */
#define PIOC_PCISR_RXBUFF		(1 << 3)

/* @def PIOC_PCISR_ENDRX
* @brief End of Reception Transfer. */
#define PIOC_PCISR_ENDRX		(1 << 2)

/* @def PIOC_PCISR_OVRE
* @brief Parallel Capture Mode Overrun Error. */
#define PIOC_PCISR_OVRE		(1 << 1)

/* @def PIOC_PCISR_DRDY
* @brief Parallel Capture Mode Data Ready */
#define PIOC_PCISR_DRDY		(1 << 0)

/* --- PIOC_PCRHR values -------------------------------------------- */


/* @def PIOC_PCRHR_RDATA
* @brief Parallel Capture Mode Reception Data. */
#define PIOC_PCRHR_RDATA_SHIFT		0
#define PIOC_PCRHR_RDATA_MASK		0xffffffff
/** @defgroup pioc_pcrhr_rdata RDATA
* @brief Parallel Capture Mode Reception Data.
@{*/
/*@}*/
